{
    "version": "https://jsonfeed.org/version/1",
    "title": "Swivro",
    "description": "",
    "home_page_url": "https://swivro.net",
    "feed_url": "https://swivro.net/feed.json",
    "user_comment": "",
    "author": {
        "name": "Casper the Ghost"
    },
    "items": [
        {
            "id": "https://swivro.net/speaklink-introduction-and-02-official-release.html",
            "url": "https://swivro.net/speaklink-introduction-and-02-official-release.html",
            "title": "Speaklink Introduction &amp; 0.2 Official Release",
            "summary": "Oh boy, yet another project/branch released by Swivro this month, what could it be this time? This one, is actually our favorite project. It's called Speaklink. Speaklink is a privacy-first communication platform. End-to-end encryption for messaging, calling, video calling, and screen sharing. Speaklink values your&hellip;",
            "content_html": "<p>Oh boy, yet another project/branch released by Swivro this month, what could it be this time?</p>\n<p>This one, is actually our favorite project. It's called Speaklink. Speaklink is a privacy-first communication platform. End-to-end encryption for messaging, calling, video calling, and screen sharing. Speaklink values your privacy and cares about security. Speaklink is <strong>easy, modern, and fast</strong>, with super lightweight code making your experience super fast, without losing any of Speaklink's great features. Use Speaklink how you want, with a light theme or a dark theme. Speaklink is accessible on any device, as long as it has internet, and a modern browser, such as Firefox, Vivaldi, Google Chrome, Microsoft Edge, etc. You can register an account aka sign up now for free WITHOUT an email address, although, an email address is highly recommended, because in the event of you forgetting or losing your password, you need an Email address to recover it. Get started at <a href=\"https://speaklink.uk.to\">https://speaklink.uk.to</a> (will open in a new tab).</p>\n<p>This specific Speaklink Version release, 0.2, has new features in comparison to the initial release, being 0.1. This new release, 0.2, features a brand new home UI sometimes referred to as a landing page or homepage. The new UI makes it easy to learn what Speaklink is, what Speaklink offers, and how Speaklink is different. Speaklink is accessible via <a href=\"https://speaklink.uk.to\">https://speaklink.uk.to</a> made possible by the FreeDNS Network. We aren't required to state that it was made possible by the FreeDNS Network, but FreeDNS sure does help us a lot, at freedns.afraid.org</p>\n<p>Like Swivro itself, Speaklink is considered a nonprofit technology group. Nonprofit as in, the primary goal is not to make a profit. We use reliable tools like GitHub, FreeDNS, and more, to keep Speaklink online 24/7 with (pretty much) zero downtime. Speaklink uses the Matrix Backend as a chat/voice/video server. You can create your own server, even hosted on your own computer inside of a VM, to host your very own Matrix Server, and then you can use Speaklink to connect to it. A matrix server is where all chat messages are stored (encrypted of course), as well as where voice/audio (for voice calls), and video (for video calls) are processed. By default, when signing up/registering to Speaklink, the public global secure Matrix server is selected. If you're a newbie, or don't want to spend money hosting your own server, or have no idea what we are talking about, then just keep the \"homeserver/matrix server\" selected on the default option being matrix.org</p>\n<p>By connecting to the global matrix.org server network, it's just as secure as if you were hosting it yourself, because everything is fully encrypted, multiple times, end-to-end. This is more secure than nearly every other communication platform on the internet. See the security comparison here (it will open in a new tab once clicked) -&gt; <a href=\"https://speaklink.uk.to/securitycomparison.html\">https://speaklink.uk.to/securitycomparison.html</a></p>\n<p>One reason we added this entire new homepage UI for Speaklink is to allow people like students, developers, and/or people learning how to code, to build on top of Speaklink; customizing it to their liking, and improving it. Speaklink is made available under the Apache 2.0 License. The source code and update/management activity can be viewed on the official GitHub Repo, seen here -&gt; <a href=\"https://github.com/kasperireland/speaklink\" target=\"_blank\" rel=\"noopener noreferrer\">https://github.com/kasperireland/speaklink</a></p>\n<p>Of course, the current latest release is 0.2 (officially 0.2.1). You can see the Speaklink code releases here -&gt; <a href=\"https://github.com/kasperireland/speaklink/releases\">https://github.com/kasperireland/speaklink/releases</a></p>\n<p>In the latest release, 0.2 (officially 0.2.1), there is currently a bug or two, along with a visual issue. These issues were fixed, and have been applied to the \"master\" branch of the repository, along with the official Speaklink instance at Speaklink.uk.to, but have not yet been applied to a release. The next Speaklink release, 0.3, will feature the fixes. SpeakLink 0.3 will have even more new features, including a mobile app, desktop app, a (possibly) slightly cleaner UI, and more.</p>\n<p>We will continue to develop Speaklink, building upon Matrix/Element, making Speaklink even better. We believe we've already simplified the sign up process.</p>\n<p>As always, donations are appreciated. We run on donations, to allow us to keep providing online services like Speaklink, and to help cover the \"cost\" of human labor hours. Due to some recent lack of funding via donations we were forced to implement Ad's to our website (the website you are currently on) to help fund us. If you would like to see these ad's get removed, feel free to donate at any time. It isn't required, but if you would like to consider donating, there is a button below. Thanks for reading and have a great day :)</p>\n<p> </p>\n<form action=\"https://www.paypal.com/donate\" method=\"post\" target=\"_top\"><input name=\"hosted_button_id\" type=\"hidden\" value=\"A5WM6RH64VRLS\"> <input title=\"PayPal - The safer, easier way to pay online!\" alt=\"Donate with PayPal button\" name=\"submit\" src=\"https://www.paypalobjects.com/en_US/i/btn/btn_donate_LG.gif\" type=\"image\"> <img loading=\"lazy\" src=\"https://www.paypal.com/en_US/i/scr/pixel.gif\" data-is-external-image=\"true\"  alt=\"\" width=\"1\" height=\"1\" border=\"0\"></form>",
            "image": "https://swivro.net/media/posts/10/New-Project-2021-07-08T175455.382.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-08T18:16:36-05:00",
            "date_modified": "2021-07-08T18:19:39-05:00"
        },
        {
            "id": "https://swivro.net/levin-password-manager-11-official-release.html",
            "url": "https://swivro.net/levin-password-manager-11-official-release.html",
            "title": "Levin Password Manager 1.1 Official Release",
            "summary": "Levin, our amazing stateless password manager, has been operating flawlessly since release. It's not perfect, and never will be absolutely spot-on perfect, but we always try to improve it as much as we can. Levin 1.1, our latest release, is indeed an improvement, making things&hellip;",
            "content_html": "<p>Levin, our amazing stateless password manager, has been operating flawlessly since release. It's not perfect, and never will be absolutely spot-on perfect, but we always try to improve it as much as we can. Levin 1.1, our latest release, is indeed an improvement, making things simpler, quicker, and less-complicated, while still delivering the same great speed, security, privacy, ya know.</p>\n<p>Levin is mind-blowingly lightweight, so there isn't much code. Being said, we just officially released Levin 1.1. Levin 1.1 can be accessed via Levin Web at levin.swivro.net or TLS.Levin.codes. Levin 1.1 is not yet pushed to the open source GitPear repository for public-use, but will be shortly. You can still download Levin 1.1 NOW via Google Drive, more on that later in this article.</p>\n<p><strong>What's changed?</strong></p>\n<p>Levin 1.1 features no major changes. Levin 1.1 includes minor JS &amp; HTML Code changes in the Levin Web App, nothing too noticeable though. Levin features a brand new homepage, with a list of some features that Levin is proud of, and a quick button, which once pressed, brings you to Levin Web. When we say Levin Web, we mean our official public instance of Levin ran by Swivro, accessible via levin.swivro.net and only levin.swivro.net. We migrated from tls.levin.codes to levin.swivro.net to ensure security and after becoming aware of potential conflicts with Name.com, the domain registrar for tls.levin.codes such as them tracking DNS Queries, not caring about privacy, and more concerns regarding our ownership of the domain name levin.codes. The new Bootstrap homepage for Levin explains how we value your privacy, how Levin has great security, and how/why it is forever free. As mentioned, this homepage is part of the 1.1 update and will be available on the official Levin repository on GitPear. </p>\n<p><strong>What's next for Levin?</strong></p>\n<p>Levin <strong>1.2</strong> is the next Levin update. It will feature an improved UI for Levin Web, cleaner/simpler code, will be more lightweight, will feature JavaScript-encoded HTML webpage Files, and more. Levin 1.2 from 1.1 (current release) should be a bigger improvement, than the improvement from 1.0 to 1.1 (current release). Levin 1.2 should be simpler, easier, faster, and smarter. Even a baby could use it. Levin 1.2 will also feature a mobile (android) and desktop (windows) app for quick &amp; easy use for Levin Web.</p>\n<p>For everyone wondering, Levin is indeed available to be used offline. This means you can run Levin on your own device without internet, it's free, it's easy, and did we mention it's free? Levin is plain HTML, CSS, and JS. Oh, and Bootstrap.</p>\n<p>Download Levin 1.1 for your own personal or commercial use with the Google Drive link below. Remember, Levin is licensed under <span style=\"text-decoration: underline;\"><strong><a href=\"https://creativecommons.org/licenses/by-nd/4.0/\">CC By ND 4.0, the license can be viewed by clicking this text.</a></strong></span></p>\n<p>Download Levin 1.1 zip file: <a href=\"https://drive.google.com/file/d/1oy451-xrUjG_LslRKtSo-6UZLkneZTXc/view?usp=sharing\" target=\"_blank\" rel=\"noopener noreferrer\">https://drive.google.com/file/d/1oy451-xrUjG_LslRKtSo-6UZLkneZTXc/view?usp=sharing</a></p>\n<p>As always, donations are extremely appreciated. We run on them, and even $1 helps us. If you would like to consider donating just one time, whether its a small amount or not, the button is below if you wish :)</p>\n<p>Thanks for reading, and have a great day.</p>\n<p> </p>\n<form action=\"https://www.paypal.com/donate\" method=\"post\" target=\"_top\"><input name=\"hosted_button_id\" type=\"hidden\" value=\"A5WM6RH64VRLS\"> <input title=\"PayPal - The safer, easier way to pay online!\" alt=\"Donate with PayPal button\" name=\"submit\" src=\"https://www.paypalobjects.com/en_US/i/btn/btn_donate_LG.gif\" type=\"image\"> <img loading=\"lazy\" src=\"https://www.paypal.com/en_US/i/scr/pixel.gif\" data-is-external-image=\"true\"  alt=\"\" width=\"1\" height=\"1\" border=\"0\"></form>",
            "image": "https://swivro.net/media/posts/9/New-Project-2021-07-08T002318.264.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-08T00:20:20-05:00",
            "date_modified": "2021-07-08T00:24:44-05:00"
        },
        {
            "id": "https://swivro.net/whats-happening-and-whats-next.html",
            "url": "https://swivro.net/whats-happening-and-whats-next.html",
            "title": "What&#x27;s happening &amp; what&#x27;s next for Swivro?",
            "summary": "It's been a pretty busy week for Swivro thus far. We've been managing GitPear and, released Levin (tls.levin.codes) and are monitoring Levin's performance, and are making some changes with our web hosting branch, HWG. We are also migrating to new servers across Swivro. HWG will&hellip;",
            "content_html": "<p>It's been a pretty busy week for Swivro thus far. We've been managing GitPear and, released Levin (tls.levin.codes) and are monitoring Levin's performance, and are making some changes with our web hosting branch, HWG. We are also migrating to new servers across Swivro.</p>\n<p><strong>HWG </strong>will more than likely STOP offering web hosting publicly on July 20th-28th which can currently be bought in an instant online. We will no longer be accepting instant orders. You will need to contact us stating that you are interesting in using HWG's (HostWithGorilla.com) services, such as $3.00 web hosting. HWG will be migrating cPanel servers from LiquidNet LTD to DigitalOcean. If you contact us via <a href=\"mailto:support@swivro.com\">support@swivro.com </a>we can offer you $1 per month <em>unlimited</em> web hosting EARLY. If you want to order existing cheap web hosting plans from HWG in an instant, you should hurry up before its too late, just go to hostwithgorilla.com</p>\n<p><strong>GitPear </strong>has now been publicly operational for more than 7 days 👏👏. However, although GitPear is a free service, we really do need donations to keep running it. All of the money we receive via donations for GitPear (or Swivro) go straight back into GitPear or Swivro. If you would like to donate to only gitpear visit <a href=\"https://liberapay.com/GitPear/donate\">liberapay.com/GitPear/donate</a></p>\n<p>GitPear cannot run without donations, which is why donations play a crucial role in keeping GitPear alive. We are currently hosting GitPear with FranTech Solutions but are looking into migrating to Microsoft's Azure Platform to increase uptime and reliability. We are absolutely not saying FranTech Solutions (BuyVM Brand) is not reliable, but they do require a reboot every now and then on their entire nodes, which will cause, <em>at most</em>, a 5 minute downtime. 5 minutes is indeed nothing as we currently see it, but as GitPear grows, more and more users will use it and we need ZERO downtime when it comes to that. Until then, we will remain a FranTech Solutions Customer, and we might never even switch to Azure if we can confirm that <span style=\"text-decoration: line-through;\"><em><span style=\"text-decoration: line-through;\">Fran doesn't spill Mountain Dew all over the server equipment</span>  </em></span>our server's uptime remains extremely close to 100%. GitPear remains free and operational, and publicly accessible via <a href=\"https://gitpear.com\">https://gitpear.com</a></p>\n<p><strong>Levin</strong> Password Manager (accessible via <a href=\"https://tls.levin.codes\">tls.levin.codes</a>) is brand new. It's based off of open source JS-based software. We sprinkled some Swivro Code on it, changed up the design, are actively working on a new back-end (on our local side), and have improved it overall. Donations are also appreciated to keep running Levin. We need donations to renew the actual domain name and virtual server hosting. Levin is also free. Like all of our branches' products, Levin is privacy-oriented. Levin doesn't unethically track you in any sense whatsoever, period. Levin doesn't sell your personal information, period. Here is a basic description of Levin: <em>Remember one master password to access all of your passwords, anywhere, on any device. No sync needed. When the same values are entered for all the fields below (on <a href=\"https://tls.levin.codes\">https://tls.levin.codes</a>), the generated password will always result the same. This makes Levin an excellent secure password generator, and password manager.</em> Levin was easy to start up, but we will be actively working on the backend and user-friendliness as time moves forward.</p>\n<p><strong>We're also looking into partnering </strong>with various companies &amp; organizations which also care about privacy and security, and offer free online services, as we do. By partnering with these organizations &amp; companies, it will benefit both of us (Us at Swivro and you. the Visitor!). It will help Swivro grow, and we also get to show you what cool thing they (our partner) are offering! We're also looking into acquiring some \"dying\" hosting businesses in an attempt to continue their services. We won't ruin them though, this aint EIG (Endurance International Group).</p>\n<p><strong>The final question; what's next?</strong> We have plans for new upcoming branches of Swivro and new products, offerings, and/or services, but we don't like to say too much until it actually happens, because plans can change in a heartbeat. In other words, we don't want to announce \"this product\" which is being released next month, but then a week later announce \"this product\" is no longer being released. Just for this post, we will say, we are working towards a new offering, which will offer DNS Hosting. It's a great alternative to ClouDNS, and CloudFlare DNS (our offering will not include a domain proxy), and will be secure and reliable with tight security measures. If you would like to help fund this new upcoming project, feel free to donate to Swivro via PayPal. It's very much truly appreciated and we will do our best to send you a personal email (Not from a bot, from a human!), being the email in your PayPal account in which you used to donate to us, thanking you for donating to us at Swivro.</p>\n<p>We always do our best to provide public updates on whats happening at Swivro, so, thank you for reading! See you next time.</p>",
            "image": "https://swivro.net/media/posts/7/New-Project-2021-07-07T000819.217.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-07T00:06:30-05:00",
            "date_modified": "2021-07-07T22:07:37-05:00"
        },
        {
            "id": "https://swivro.net/introducing-levin-password-manager.html",
            "url": "https://swivro.net/introducing-levin-password-manager.html",
            "title": "Introducing Levin Password Manager",
            "summary": " Introducing Levin. Levin is a password manager, that doesn't store any passwords. Makes sense right? Levin looks more like a password generator at first, and you wouldn't be wrong, it works, feels, and looks like one. Levin lets you generate and access various passwords&hellip;",
            "content_html": "\n  <p>\n    Introducing Levin. Levin is a password manager, that doesn't store any passwords. Makes sense right? Levin looks more like a password generator at first, and you wouldn't be wrong, it works, feels, and looks like one. \n<br>\n<br>Levin lets you generate and access various passwords for various sites with only a single master password. That's right, all you have to remember is the master password. Remember one master password to access all of your passwords, anywhere, anytime, on any device. No synchronization between devices is needed. What, how? Well, it's because, when the same values are entered for the site name, username, and master password (and password length and specifications, both optional), the same exact password will always be generated. For example, if for the username, I put \"test\", for the site name, I put \"test\" and for the master password, I put \"test\", the password will always result as the following:\n<br>\n<br>n5OOmzRroYD{y[PGmgEMzf5/nc_{yzdB\n<br>\n<br>\n<br>\n<br>You can test this on your own at Levin, accessible here https://tls.levin.codes and if you put \"test\" for every input/text value, including the site name, username, and master password, it will always result the same. In this case, it is the value specified above this paragraph, in italics.\n<br>\n<br>Now, how secure is it? A combination of the site name, username, and master password is SHA512/224 hashed. The output hash is encoded using a modified form of the Base64 encoding algorithm, mapping 3 character input segments to 4 characters of output. Can't understand that? It means it's pretty darn good security-wise. We don't hide anything from you either, Levin is based on open source software which you can see in the source code as a comment line. Additionally, we have licensed Levin under CC by ND 4.0. This means you can use Levin for both personal or commercial use, but attribution is required, and if you remix, transform, or build upon the material, you may not distribute the modified material.\n<br>\n<br>Additionally, along with the encryption methods stated above, your connection to the Levin website also features two layers of encryption, both being TLS Certificates. The outer layer of encryption is the CloudFlare TLS Certificate, which encrypts the connection between your browser, and CloudFlare. The inner layer of encryption, serverside, features (usually) a self-signed Levin TLS Certificate. On some occasions, a Let's Encrypt/R3, or ZeroSSL TLS Certificate will be used. Typically, we use self-signed Levin TLS Certificates. This makes a total of more than 4 encryption methods (when counting server encryption, and more) throughout Levin.\n<br>\n<br>Levin will be available forever, even if Swivro were to shut down, a rather impossible event. Levin is independently managed by its own team, Swivro itself does not actively make its own changes to Levin or any of its projects. Try Levin Now &gt; https://tls.levin.codes/\n<br>\n<br>Feel free to donate to us at any time, since we run solely on donations, and sadly, we don't have a lot of patrons. Thank you for reading.\n  </p>\n<div><form action=\"https://www.paypal.com/donate\" method=\"post\" target=\"_top\">\n<input name=\"hosted_button_id\" type=\"hidden\" value=\"A5WM6RH64VRLS\" />\n<input alt=\"Donate with PayPal button\" border=\"0\" name=\"submit\" src=\"https://www.paypalobjects.com/en_US/i/btn/btn_donate_LG.gif\" title=\"PayPal - The safer, easier way to pay online!\" type=\"image\" />\n<img loading=\"lazy\" alt=\"\" border=\"0\" height=\"1\" src=\"https://www.paypal.com/en_US/i/scr/pixel.gif\" data-is-external-image=\"true\"  width=\"1\" />\n</form>\n</div>",
            "image": "https://swivro.net/media/posts/1/New-Project-2021-07-05T163512.600.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-05T18:34:20-05:00",
            "date_modified": "2021-07-05T18:37:01-05:00"
        },
        {
            "id": "https://swivro.net/gitpear-is-fully-operational.html",
            "url": "https://swivro.net/gitpear-is-fully-operational.html",
            "title": "GitPear is fully operational",
            "summary": "GitPear, the #1 best alternative to GitHub (FREE Code Hosting), managed and owned by us at Swivro, has officially been operational since June 30th, 2021. GitPear is in a stable production state, and is no longer buggy or unstable. GitPear is now available to anyone,&hellip;",
            "content_html": "<p>GitPear, the #1 best alternative to GitHub (FREE Code Hosting), managed and owned by us at Swivro, has officially been operational since June 30th, 2021. GitPear is in a stable production state, and is no longer buggy or unstable. GitPear is now available to anyone, anywhere. Although GitPear does indeed offer all free services, donations are very appreciated, as we run on donations and are funded by Arc.io every so often.</p>\n<p> </p>\n<div>Let's get started with some of the obvious changes. The logo. The logo has a new color and look. Here you can see a comparison of the logo when GitPear opened and the new logo.</div>\n<div> </div>\n<div><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://i.imgur.com/CVyZkU6.png\" data-is-external-image=\"true\"  alt=\"\" width=\"355\" height=\"340\"></figure></div>\n<div>\n<div>\n<div class=\"separator\">Yes, we know, the old logo does look more like a pear, as the color is more similar to the color of an actual pear, but we wanted to switch things up, and create a \"modern color\" pear. It pops out more, looks cooler, but it doesn't give you a better feeling about if the pear is ripe or not.</div>\n<div class=\"separator\">GitPear, of course, is based on the Open Source Gitea Software, which you can see at any time via this GitHub Mirror hosted at GitPear: <a href=\"https://gitpear.com/kasper/gitea\">https://gitpear.com/kasper/gitea</a></div>\n<div class=\"separator\"> </div>\n<div class=\"separator\">GitPear wont last forever if we cannot fund it. To fund it, we need donations. We're not requiring it but we do really appreciate it, you can donate directly to GitPear via PayPal or Card. All of the money goes straight back into GitPear.</div>\nSwivro is considered a nonprofit, but not the legal entity type (IE: 501[c3]). We are a nonprofit technology group, MEANING, our primary objective is not to make a profit, but obviously, we will need to make some money to keep operating our services. Some of our (Swivro) brands or divisions do not offer free services, and those brands can sustain themselves as they actively make a profit intentionally, but nonprofit brands like GitPear require donations to keep running.</div>\n<div>If you would like to donate directly to GitPear, feel free to do so here: <a href=\"https://liberapay.com/GitPear/donate\">https://liberapay.com/GitPear/donate</a><br><br></div>\n<div>Back on the topic. GitPear now also features a Dark Theme, called Arc-Green. So when you are browsing your code on GitPear at night, or your just the type of person that doesn't enjoy burning their corneas, then you can use this dark theme by logging into your GitPear account, going to Settings -&gt; Account, then scroll down to Theme. Arc-Green Dark Theme is developed by Gitea. We have not have it enabled until now.</div>\n<div> </div>\n<div>We took a while to figure this one out, we needed to pick a server provider to host GitPear. We looked through lots of providers, including Hetzner, NetCup, Contabo, OVH, Azure, and more, but when comparing prices, features, speed, DDoS Protection, and value, side by side, BuyVM by FranTech had won, and we are now happily hosting with them, on a KVM Dedicated Slice.</div>\n<div> </div>\n<div>If you have any queries or concerns feel free to contact us via the Contact Page on this website. Thanks for reading!</div>\n</div>",
            "image": "https://swivro.net/media/posts/2/Screenshot_20.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-03T19:05:00-05:00",
            "date_modified": "2021-07-05T19:10:39-05:00"
        },
        {
            "id": "https://swivro.net/re-announcing-gitpear.html",
            "url": "https://swivro.net/re-announcing-gitpear.html",
            "title": "Re-announcing GitPear",
            "summary": "GitPear was a project started by Swivro in late 2019, and was public in early 2020. In a few months time, GitPear had shut down due to lack of appropriate funding, because as you may not know, Swivro is an unregistered nonprofit internet-based organization. GitPear&hellip;",
            "content_html": "<p>GitPear was a project started by Swivro in late 2019, and was public in early 2020. In a few months time, GitPear had shut down due to lack of appropriate funding, because as you may not know, Swivro is an unregistered nonprofit internet-based organization.</p>\n<p>GitPear is officially being restarted, and will be publicly available in a few days or weeks time. Although we are indeed restarting GitPear as a free service, donations are GREATLY appreciated. If you cannot donate, or simply don't want to (which is totally fine!), as an alternative method of donating, you can simply keep a few tabs of our homepage, swivro.net, open in your browser.</p>\n<p>Why keep it open in your browser you ask? We use a website called Arc to help fund Swivro to keep providing online services, as we are a nonprofit. Arc is a peer-to-peer content exchange and delivery network (CDN). Swivro users share bandwidth (completely safe and secure with absolutely no risk involved), Arc.io rents it, and Swivro gets paid the proceeds. This allows us to make money to fund Swivro whilst not displaying ads on our website. This way, you don't have to directly donate.</p>\n<p>Direct Donations are still greatly appreciated as they help us even more.</p>\n<p>GitPear will be available via the domain name GitPear.com some time in 2021, we will update you with a new post here on our Blog accessible via swivro.net when GitPear is available.</p>\n<p>Thank you for reading!</p>",
            "image": "https://swivro.net/media/posts/3/New-Project-92-1-1.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-06-22T19:13:00-05:00",
            "date_modified": "2021-07-05T19:14:23-05:00"
        }
    ]
}
