{
    "version": "https://jsonfeed.org/version/1",
    "title": "Swivro",
    "description": "",
    "home_page_url": "https://news.swivro.net",
    "feed_url": "https://news.swivro.net/feed.json",
    "user_comment": "",
    "icon": "https://news.swivro.net/media/website/New-Project-20l21-07-15T182949.916.png",
    "author": {
        "name": "Casper the Ghost"
    },
    "items": [
        {
            "id": "https://news.swivro.net/introducing-glenn-website-manager.html",
            "url": "https://news.swivro.net/introducing-glenn-website-manager.html",
            "title": "Introducing Glenn Website Manager",
            "summary": "Introducing Glenn Website Manager, a simple software that lets you manage your website content, website files, emails, MySQL Databases, DNS,&hellip;",
            "content_html": "<p>Introducing Glenn Website Manager, a simple software that lets you manage your website content, website files, emails, MySQL Databases, DNS, and more.</p>\n<p>Glenn is a Windows Server software. This means Glenn is designed to run on the Windows Server OS (plain Windows may work as well), and not Linux. Glenn is designed to only manage one website, meaning it is not a control panel for shared hosting. If you are hosting 5 websites, you cannot use Glenn to manage them all on the same (windows) server, for that we recommend Plesk. If you want to host multiple websites using Glenn, and say you have 5 websites, you will need 5 servers (or virtual servers, which come at a cheap price), each having Glenn installed.</p>\n<p>Glenn features a very easy to use UI, integrated PHPMyAdmin, a File Manager, a Windows Service Manager (stop/start/restart the web server, MySQL, and more), an OS Auto-Restart Scheduler, integrated PHP, and more. The UI isn't intended to be extremely elegant and beautiful, but is more of a simple, minimal, yet modern interface which is just meant to get stuff done fast &amp; easily, not to admire how beautiful it is.</p>\n<p>Glen doesn't use Windows IIS, the web server software that comes with the Windows Server OS (although for the first version of Glenn, it might, more on that later). It uses our custom web server software, powered by ElectronJS, with the latest PHP Version integrated. The Glenn Control panel also shows real-time stats for RAM and CPU Usage, as well as your public IPv4 address. Glenn uses the .NET Framework, meaning in order to use Glenn on your Windows Server/Virtual Server, you will need to install the .NET Framework from Microsoft's website.</p>\n<p>Glenn also features anti-bot protection. Any HTTP Requests to the web server which seem malicious, unusually repetitive, or fishy, will be blocked from accessing the web server (port 80/443), and will be blacklisted. The first version of Glenn will NOT have anti-bot protection, nor will it have the custom ElectronJS PHP Web Server, but will have every other feature. In future versions of Glenn, those features will be integrated.</p>\n<p>Glenn, of course, like most of our other projects, is available at no cost. At the time of writing this article, the first version of Glenn is estimated to be released in approximately 24 days and 5 hours. Glenn isn't incredibly hard to develop, but due to limited time &amp; resources, we can't make it in one day, and release it the same day, without the software being public whilst having issues/bugs &amp; security risks. You can see the live countdown here on our new website layout. <a href=\"https://swivro.net/glenn\" target=\"_blank\" rel=\"noopener noreferrer\">https://swivro.net/glenn</a> (more info about our new website layout coming soon).</p>\n<p>If you still want to host a website, but aren't very technical, or don't want to spend a lot of money on an entire dedicated virtual server, but are looking for good quality shared website hosting, we recommend <a href=\"https://sitefold.co/\">Sitefold.co</a> or <a href=\"https://businessmanaged.org\">BusinessManaged.org</a></p>\n<p>Thanks for reading, and as always, if you would like to donate to Swivro to support what we do, feel free to do so <a href=\"https://news.swivro.net/donate\">here</a>.</p>",
            "image": "https://news.swivro.net/media/posts/26/screenshot-37-1092x591.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-21T18:31:25-05:00",
            "date_modified": "2021-07-21T18:33:39-05:00"
        },
        {
            "id": "https://news.swivro.net/swivro-takes-over-privacywebringusto.html",
            "url": "https://news.swivro.net/swivro-takes-over-privacywebringusto.html",
            "title": "Swivro takes over PrivacyWebring.us.to",
            "summary": "Today, July 18th, we were speaking with the Owner of PrivacyWebring.us.to. The Owner had told us he was no longer&hellip;",
            "content_html": "<p>Today, July 18th, we were speaking with the Owner of PrivacyWebring.us.to. The Owner had told us he was no longer able to run that website, leading to Swivro taking it now over, just minutes ago. PrivacyWebring.us.to is accessible at <a href=\"https://privacywebring.us.to\">https://privacywebring.us.to</a> and has been running since 2009. PrivacyWebring.us.to is an internet webring for websites that support online internet privacy, and value their visitors' privacy.</p>\n<p>As the previous owner of PrivacyWebring.us.to said:</p>\n<blockquote>\n<p>If you would like to put the privacy webring symbol somewhere on the footer of your website, feel free to do so. By doing so, it would show that you and your website respects online internet privacy and values peoples online privacy. Copy the code below and place it somewhere in the footer of your website. (code can be seen at privacywebring.us.to)</p>\n</blockquote>\n<p>PrivacyWebring.us.to as it did, continues to run on GitHub Pages and Afraid FreeDNS to avoid any website fees. Soon, we will start listing websites that use PrivacyWebring.us.to and if you would like your site to be listed there, please email <a href=\"mailto:support@swivro.com\">support@swivro.com </a>with your website name. Please note, obviously, you must have PrivacyWebring.us.to on your website (see how to integrate it at <a href=\"https://privacywebring.us.to\">https://privacywebring.us.to</a>). The design of the official website does look a bit... rough, aka dated, since it has hardly been updated since 2009, but we wil<span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">l be updating the design to be more modern soon.</span></p>\n<p>Thanks for reading.</p>\n<div class=\"language-plaintext highlighter-rouge\">\n<div class=\"highlight\"> </div>\n</div>",
            "image": "https://news.swivro.net/media/posts/25/New-Project-2021-07-19T001925.665.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-18T22:18:59-05:00",
            "date_modified": "2021-07-19T00:20:00-05:00"
        },
        {
            "id": "https://news.swivro.net/noteovh-take-notes-in-a-hurry.html",
            "url": "https://news.swivro.net/noteovh-take-notes-in-a-hurry.html",
            "title": "Note.ovh; Take notes in a hurry",
            "summary": "Note.ovh has been in operation since April, but has never had an official announcement from us. Note.ovh, as the name&hellip;",
            "content_html": "<p>Note.ovh has been in operation since April, but has never had an official announcement from us. Note.ovh, as the name suggests, is accessible from typing note.ovh into your web browser URL bar. Note, also as the name suggests, allows you to take notes in a hurry. It is straight to the point, there is no landing page. When you visit note.ovh the entire webpage is a notepad, which automatically saves your notes. Simply type in some notes or text on note.ovh in your browser, and then close that browser tab. You can close the browser tab without losing your notes because all note content is automatically saved into your browser's localstorage. This is very secure, because it means we don't store it on any online public database, and it's encrypted in your browser.</p>\n<p>Note.ovh is also of course 100% free and we rely on donations to run it. If you would like to consider donating, feel free to do so here, <a href=\"https://news.swivro.net/donate.html\">only</a> if you wish to do so.</p>\n<p>Note.ovh currently has a browser extension for Microsoft Edge. If you would like to use Note.ovh on Microsoft Edge as a browser extension, meaning you will be able to save and access your notes in just a click, using the Note.ovh Microsoft Edge Browser Extension, feel free to check it out here: <a href=\"https://microsoftedge.microsoft.com/addons/detail/noteovh/jmnfekjojfnpbfhgjjaaoiclbagapoef\" target=\"_blank\" rel=\"noopener noreferrer\">https://microsoftedge.microsoft.com/addons/detail/noteovh/jmnfekjojfnpbfhgjjaaoiclbagapoef</a></p>\n<p>The Note.ovh Microsoft Edge browser extension allows you to quickly create notes while still surfing the web, without having to exit, minimize, or shrink your browser window. Say you are on Amazon and you find a product you would like to purchase later that day (let's call it product A). You would open the Note.ovh browser extension by clicking the Note.ovh icon on your browser toolbar, you could write down \"Buy product A for Bob's project later today\", and then close the Note.ovh window. It's that easy. As of right now we <strong>only</strong> support Microsoft Edge for a browser extension, but Note.ovh can still be used on any other browser, like Google Chrome, Firefox, or even <em>Safari</em> on <em>macOS</em> if you're psychotic, by simply navigating to Note.ovh</p>\n<p><strong>EDIT: </strong>Note.ovh is now available for Firefox, Firefox Developer Edition, and Waterfox. You can add Note.ovh on Firefox, Firefox Developer Edition, or Waterfox by adding it via the Mozilla Firefox Browser Add-ons directory, with the Note.ovh addon being accessible here: <a href=\"https://addons.mozilla.org/en-US/firefox/addon/note-ovh/\" target=\"_blank\" rel=\"noopener noreferrer\">https://addons.mozilla.org/en-US/firefox/addon/note-ovh/</a></p>\n<p>Note.ovh for Firefox is different than Note.ovh for Microsoft Edge. On Microsoft Edge, Note.ovh, as a browser extension, is accessible by clicking the Note.ovh Icon on the browser toolbar on the top right. On Firefox, Note.ovh is be opened as a sidebar where you can take notes at any time while browsing the web. The sidebar will always be open, even while you are browsing the web, but we made sure to not make it annoying. Try Note.ovh for Firefox with the addons.mozilla.org link above this paragraph.</p>\n<p>Thanks for reading!</p>",
            "image": "https://news.swivro.net/media/posts/24/New-Project-2021-07-18T191140.977.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-18T19:22:21-05:00",
            "date_modified": "2021-07-19T18:35:50-05:00"
        },
        {
            "id": "https://news.swivro.net/download-youtube-videos-for-free-savemyvids-release.html",
            "url": "https://news.swivro.net/download-youtube-videos-for-free-savemyvids-release.html",
            "title": "Download YouTube videos for free (SaveMyVids Release)",
            "summary": "Hi there, SaveMyVids is a new project just released by Swivro. It is based off of YouTube Downloader, and uses&hellip;",
            "content_html": "<p>Hi there, SaveMyVids is a new project just released by Swivro. It is based off of YouTube Downloader, and uses the YouTube-DL Library for downloading YouTube videos and ElectronJS to run as a desktop application.  It's 100% free, and is made available publicly, under the Public Domain, with the source code being on GitHub.</p>\n<p>If you don't care about the code or don't want to look at it, you can download the latest release directly, on the SaveMyVids website, at <a href=\"http://savemyvids.uk.to\">http://savemyvids.uk.to</a> where you can also find screenshots of the application running. Stop paying for that YouTube Premium garbage to download YouTube videos, and just use SaveMyVids. As mentioned, it’s free and runs on desktop platforms.</p>\n<p>This post is short because SaveMyVids is a small project we decided to create just for fun, there isn't much to it, and it won't be updated constantly. Thanks for reading.</p>\n<p><a href=\"http://savemyvids.uk.to\">http://savemyvids.uk.to</a></p>",
            "image": "https://news.swivro.net/media/posts/23/New-Project4.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-17T12:06:03-05:00",
            "date_modified": "2021-07-17T12:09:30-05:00"
        },
        {
            "id": "https://news.swivro.net/swivro-now-runs-businessmanagedorg.html",
            "url": "https://news.swivro.net/swivro-now-runs-businessmanagedorg.html",
            "title": "Swivro now runs BusinessManaged.org",
            "summary": "Hello friends, On July 13th, 2021, Swivro acquired &amp; took over BusinessManaged.org BusinessManaged.org is a managed web hosting platform. BusinessManaged.org&hellip;",
            "content_html": "<p>Hello friends,</p>\n<p>On July 13th, 2021, Swivro acquired &amp; took over BusinessManaged.org</p>\n<p>BusinessManaged.org is a managed web hosting platform. BusinessManaged.org will build, manage, maintain, and host your own website for as low as $2 per month (if paid yearly at $24/year). BusinessManaged.org also provides web hosting for people on the pro side of websites &amp; all things web hosting, with an advanced web hosting control panel (DirectAdmin Control Panel). BusinessManaged.org is basically a great option for people who want to build a website, know what content they want their website to have, but need some help getting there. Rather than figuring all of this out on your own, and spending your own time, BusinessManaged.org can do it all for you.</p>\n<p>On July 13th, 2021, when we acquired BusinessManaged, we got a new domain name for BusinessManaged (being businessmanaged.org) and redesigned the entire website (it had no official website previously). Whether you are trying to create a business or personal website, BusinessManaged.org can work out great for you. If you are in need of a custom solution, and our standard web hosting isn't powerful enough, simply open a live chat session with us and we can give you a quote.</p>\n<p>Although BusinessManaged is indeed very affordable, with all products at a very low price, BusinessManaged now only offers support (via live chat) every day of the week &amp; weekend, 1:30PM-5:30PM PT/PST, or 4:30PM-8:30PM ET/EST. After the acquisition of BusinessManaged, we began migrating cloud instance/virtual server service providers from Amazon Web Services (AWS) to BuyVM by FranTech. This allows for increased stock (aka how many times x product can be ordered before running out of space/stock), less limitations, and faster speeds. This is definitely a service quality increase for BusinessManaged.org</p>\n<p>We've also finalized a new pricing structure for BusinessManaged.org which is now live. Existing clients have been swapped to the new pricing structure. No existing clients are unhappy, because the new pricing structure is even more affordable (est 75% decrease in price). BusinessManaged.org's Enterprise Managed plan/option was previously (rounded up) $350 per year, and is now $195 per year. BusinessManaged will continue to use Fastspring as a payment processor aka billing solution and Tawk for a live support chat.</p>\n<p>BusinessManaged.org is NOT one of our libre/free services and is our ONLY service which REQUIRES a payment to be made before being able to access the service.</p>\n<p>See the <strong>NEW &amp; IMPROVED</strong> BusinessManaged.org at <a href=\"https://businessmanaged.org\">https://businessmanaged.org</a></p>\n<p>Thanks for reading and have a nice day.</p>",
            "image": "https://news.swivro.net/media/posts/21/New-Project-2021-07-15T191514.368.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-15T18:53:42-05:00",
            "date_modified": "2021-07-15T19:15:26-05:00"
        },
        {
            "id": "https://news.swivro.net/pickmyhost-project-cancellation.html",
            "url": "https://news.swivro.net/pickmyhost-project-cancellation.html",
            "title": "PickMyHost; Project Cancellation",
            "summary": "Hey there. The other day, we posted an update stating that we would be publicly releasing a project called PickMyHost,&hellip;",
            "content_html": "<p>Hey there. The other day, we posted an update stating that we would be publicly releasing a project called PickMyHost, allowing you to go through a series of questions, and based on those questions, you will be recommended a hosting provider based on your needs, budget, etc, which you were to select while going through the form.</p>\n<p>Unfortunately, due to several concerns regarding PickMyHost, it will no longer be publicly available, or available at all. The project has been cancelled and further work on this project has been ceased. For privacy reasons, we will not provide the full reasoning behind why this project was cancelled, but we will assure you; after extensive research and several brief reviews of the project &amp; multiple overviews &amp; comparisons, we came to a conclusion that PickMyHost should not be publicly released or should continue to be developed.</p>\n<p>We hope you understand, and we look forward to offering even more services in the future, in addition to our current offerings. Thanks for reading.</p>",
            "image": "https://news.swivro.net/media/posts/20/New-Project-2021-07-15T151632.796.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-15T15:21:56-05:00",
            "date_modified": "2021-07-15T15:21:56-05:00"
        },
        {
            "id": "https://news.swivro.net/introducing-atlasdns-first-we-need-your-help.html",
            "url": "https://news.swivro.net/introducing-atlasdns-first-we-need-your-help.html",
            "title": "Introducing AtlasDNS; First we need your help!",
            "summary": "Swivro has successfully tested &amp; wants to start up a service called AtlasDNS. AtlasDNS would be a free privacy-oriented secure&hellip;",
            "content_html": "<p>Swivro has successfully tested &amp; wants to start up a service called AtlasDNS. AtlasDNS would be a free privacy-oriented secure DNS Hosting platform. You could manage your domain name's DNS Records using AtlasDNS. AtlasDNS would be a great alternative to ClouDNS, Namecheap's FreeDNS Program, Duck DNS, NO-IP, and even CloudFlare.</p>\n<p>AtlasDNS would let you create UNLIMITED DNS Records for up to 50 domain names. You can get these limits lifted &amp; receive access to be able to DNS-host up to 500 domain names in exchange for a small monthly donation (amount to be decided). AtlasDNS would eventually, most likely, feature a proxy option, similar to CloudFlare's Proxy System. You will be able to create a DNS record pointing to your origin server, still resolving all of the same data, whilst proxying your websites traffic through AtlasDNS's servers. AtlasDNS will feature advanced DDoS Protection (possibly powered by Path.net DDoS Mitigation), so by proxying your website traffic through AtlasDNS, you will be protected against not just standard protocol (Layer 4) DDoS Attacks, but also HTTP Flood (Layer 7 DDoS) Attacks. This would make AtlasDNS essentially an alternative to CloudFlare, but, the difference being, CloudFlare's main focus is their CDN network, to speed up websites aka improve their loadtime, while AtlasDNS's main focus is to defend against Cyber-Attacks (such as DDoS attacks &amp; more) and to respect your privacy. Basically, if you're using CloudFlare for proxying &amp; DDoS attack mitigation, there's no point in using it over AtlasDNS :)</p>\n<p>Even if the proxy feature were to be not added, AtlasDNS would still be a great DNS service, being primarily a privacy-respecting free alternative to CloudFlare DNS, ClouDNS, and much more.</p>\n<p>The official AtlasDNS website is <a href=\"https://atlasdns.uk.to\">https://atlasdns.uk.to</a></p>\n<p>The only issue is, projects like AtlasDNS are not free to run. They cost money and we spend our time working on things like AtlasDNS. We need to pay for things like a virtual server to host the DNS System, an order system, a domain name, and more. <strong>If you would like to perhaps see AtlasDNS become a reality, please consider donating a small amount of money to Swivro, even as low as $5. </strong>You might think we would have said \"as low as $1\" but with the new PayPal Fee's paypal would take well over 50% of that $1, so we would only receive around $0.40, whereas if you donate a small amount of $5, we would receive around $4.45. If you would like to donate, there is a button below to do so. Thank you for considering donating, and have a great day :)</p>\n<p> </p>\n<form action=\"https://www.paypal.com/donate\" method=\"post\" target=\"_top\"><input name=\"hosted_button_id\" type=\"hidden\" value=\"MBSGS9FFWADWJ\"> <input title=\"PayPal - The safer, easier way to pay online!\" alt=\"Donate with PayPal button\" name=\"submit\" src=\"https://www.paypalobjects.com/en_US/i/btn/btn_donateCC_LG.gif\" type=\"image\"> <img loading=\"lazy\" src=\"https://www.paypal.com/en_US/i/scr/pixel.gif\" data-is-external-image=\"true\"  alt=\"\" width=\"1\" height=\"1\" border=\"0\"></form>",
            "image": "https://news.swivro.net/media/posts/19/New-Project-2021-07-14T180608.984.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-14T18:26:42-05:00",
            "date_modified": "2021-07-14T20:05:27-05:00"
        },
        {
            "id": "https://news.swivro.net/introducing-pickmyhost.html",
            "url": "https://news.swivro.net/introducing-pickmyhost.html",
            "title": "Introducing PickMyHost",
            "summary": "Today I will be introducing PickMyHost. It's not a complicated concept. It's a website that picks what hosting service is&hellip;",
            "content_html": "<p>Today I will be introducing PickMyHost. It's not a complicated concept. It's a website that picks what hosting service is right for you, whether that's website hosting, reseller hosting, virtual server hosting, email hosting, DNS hosting, and more. PickMyHost is essentially a great alternative to HostAdvice or HostingAdvice. The difference is, PickMyHost respects your privacy, as do all Swivro Products &amp; Services, and PickMyHost only recommends top quality services, whereas on HostAdvice, you literally can easily be recommended &amp; referred to fake companies that scam their clients and are ran by 10 year old's during the summer time. PickMyHost by Swivro verifies that all companies it recommends are legit and are at the level of quality possible. PickMyHost is absolutely 100% free, and all it takes to use it is to go to the PickMyHost website. Do note, PickMyHost is not yet available to the public, but will be soon, on it's release date, more about the release date later in this post. Below you can see a screenshot of what the PickMyHost interface currently looks like and what it is expected to look like on its release date. </p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://news.swivro.net/media/posts/18/Screenshot_27.png\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://news.swivro.net/media/posts/18/responsive/Screenshot_27-xs.png 300w ,https://news.swivro.net/media/posts/18/responsive/Screenshot_27-sm.png 480w ,https://news.swivro.net/media/posts/18/responsive/Screenshot_27-md.png 768w\"  alt=\"\" width=\"421\" height=\"208\"></figure>\n<p>Options like DNS Hosting have not yet been added but are in the works. After picking an option, such as VPS Hosting, you will be brought to another page. Let's say I chose VPS (aka virtual server) hosting. It will then bring me to a page based on VPS Hosting, asking more questions. Here's a screenshot of what that would look like:</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://news.swivro.net/media/posts/18/Screenshot_28.png\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://news.swivro.net/media/posts/18/responsive/Screenshot_28-xs.png 300w ,https://news.swivro.net/media/posts/18/responsive/Screenshot_28-sm.png 480w ,https://news.swivro.net/media/posts/18/responsive/Screenshot_28-md.png 768w\"  alt=\"\" width=\"408\" height=\"264\"></figure>\n<p>After picking one of those options, it will bring you to yet another page asking what specifications you are looking for, and then from there, you will be brought to a page stating what host is right for you. We haven't finished the VPS Hosting page options (screenshot above) yet, so we can't show you what happens after clicking one of those buttons, because nothing happens (yet). If you go through the web hosting options, you will eventually come to a conclusion to what host is right for you, so here's a screenshot of what that would likely look like (design is not finalized):</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://news.swivro.net/media/posts/18/Screenshot_29.png\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://news.swivro.net/media/posts/18/responsive/Screenshot_29-xs.png 300w ,https://news.swivro.net/media/posts/18/responsive/Screenshot_29-sm.png 480w ,https://news.swivro.net/media/posts/18/responsive/Screenshot_29-md.png 768w\"  alt=\"\" width=\"400\" height=\"257\"></figure>\n<p>This project, PickMyHost, seems like a piece of cake and that it can be done in a quick hour or so, but keep in mind; I have limited time and resources, and I'm currently the only one at Swivro making these new projects. PickMyHost will have some affiliate links, after you click on 'See Pricing' for a provider that PickMyHost recommends to you based on your selections, but it will not have a lot of affiliate links. PickMyHost's job is not to make a profit via affiliate links or via ads, but it's goal is to just genuinely help people pick a hosting provider that is right for them.</p>\n<p>PickMyHost came into existence last week, and should be finalized &amp; <strong>publicly released &amp; available this week</strong>. At the time of release, we will update you via a new post here at Swivro and will provide the URL/Link to PickMyHost.  </p>\n<p>If you're wondering why no posts were made here at Swivro for 3 days, it's because, as mentioned before, I have limited time and resources and cannot post updates multiple times every day of the year.</p>\n<p>As always, donations are appreciated. We run on donations, to allow us to keep providing online services like PickMyHost, and to help cover the \"cost\" of human labor hours. Due to some recent lack of funding via donations we were forced to implement Ad's to our website (the website you are currently on) to help fund us. If you would like to see these ad's get removed, feel free to donate at any time. It isn't required, but if you would like to consider donating, there is a button below. Thanks for reading and have a great day :)</p>\n<p> </p>\n<form action=\"https://www.paypal.com/donate\" method=\"post\" target=\"_top\"><input name=\"hosted_button_id\" type=\"hidden\" value=\"A5WM6RH64VRLS\"> <input title=\"PayPal - The safer, easier way to pay online!\" alt=\"Donate with PayPal button\" name=\"submit\" src=\"https://www.paypalobjects.com/en_US/i/btn/btn_donate_LG.gif\" type=\"image\"> <img loading=\"lazy\" src=\"https://www.paypal.com/en_US/i/scr/pixel.gif\" data-is-external-image=\"true\"  alt=\"\" width=\"1\" height=\"1\" border=\"0\" loading=\"lazy\" data-is-external-image=\"true\"></form>",
            "image": "https://news.swivro.net/media/posts/18/New-Project-2021-07-13T223841.177.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-13T22:32:48-05:00",
            "date_modified": "2021-07-13T22:38:57-05:00"
        },
        {
            "id": "https://news.swivro.net/how-exactly-do-we-value-your-privacy.html",
            "url": "https://news.swivro.net/how-exactly-do-we-value-your-privacy.html",
            "title": "How exactly do we &#x27;value&#x27; your privacy?",
            "summary": "Here at Swivro, we are privacy-oriented. We care about privacy and security. We do our best to ensure your data&hellip;",
            "content_html": "<p>Here at Swivro, we are privacy-oriented. We care about privacy and security. We do our best to ensure your data is secure, safe, and private. We don't unethically share data with any 3rd parties and we cannot be acquired.</p>\n<p>Swivro doesn't sell your data, PERIOD.</p>\n<p>\"But wait, you just said you're privacy oriented and care sooo much about security and privacy, but you literally use CloudFlare and Google Ads! What the heck man!??!?!?\" - We are privacy oriented, and we really do care about security, Jimmy, but since our primary goal is not to make a profit (hence we considered a nonprofit), and Swivro itself does not sell commercial products as a for-profit company, we need to run a small amount of Ads on our website to continue running. It does suck, but it's one of few ways we can make money to continue running. Swivro itself does not unethically track you whatsoever, we promise. We use CloudFlare to mitigate cyber-attacks, as we do not have the funding to cover the cost of advanced in-house DDoS Protection.</p>\n<p><span style=\"text-decoration: underline;\"><strong>Moving on,</strong></span><strong> </strong>we don't collect what we don't have to, and we don't share data that isn't required to be shared. If you are a child and are under the age of 13, we will not intentionally collect your data, as per our Privacy Policy. If you are indeed under the age of 13, and have used our services, please contact us immediately and we will do our best to wipe all data in which we may have collected from you. If you are looking for the boring Privacy Policy you can see it at swivro.net/privacy-policy</p>\n<p>Yeah, that's right, I'm not even going to embed it as a clickable link (the privacy policy link above), that's how boring it is. You'll just have to put in some effort and copy and paste the link into your browser if you really want to read a boring paragraph.</p>\n<p><strong>We do our best to not store your information</strong></p>\n<p>In the case of us being contacted by a federal entity or any type of law enforcement, being forced to provide/give up information such as email addresses, IP Addresses, or general location of a visitor/user (you), Swivro will indeed give up this information. However, we do our best to NOT store any of this information whatsoever, so if we don't have this data, there is no data to share, therefore, there is no information to give up to law enforcement if/when asked.</p>\n<p>As of July 10th, 2021, the following products do collect &amp; store your data/information:</p>\n<p><strong>- File Storage/Swivro Drive</strong></p>\n<p><strong>- GitPear</strong></p>\n<p>Both of them require an email address to sign up for an account aka register for an account, hence, we have to store those email addresses in our database. Your IP Address is logged as well, but we do our best to delete it from our database as fast as possible, as frequent as possible, so that there is no data to share when asked to share data (in this case, IP addresses is the 'data' we are talking about).</p>\n<p>As of July 10th, 2021, Swivro does <strong>NOT</strong> collect your data/information from the following products:</p>\n<p><strong>- Speaklink</strong></p>\n<p><strong>- Levin</strong></p>\n<p>Although Speaklink does ask for an email address upon registration, Swivro does not host any of the chat/communication servers. The default \"homeserver\" (the physical server your data is stored on in Speaklink) is set to matrix.org. Matrix.org is the #1 Public Matrix Server (Speaklink uses the Matrix Protocol), so all data would be stored on Matrix.org's database (IF matrix.org was your selected homeserver), so Swivro would not have any access. We do host the frontend of Speaklink, but not the backend, and the frontend does not collect your data/information.</p>\n<p>Levin (Password Manager) has no data collection involved whatsoever. It's a static web app, meaning all code is ran locally on your machine. It doesn't reach out to any 3rd party websites, applications, or analytical servers, hence, Levin doesn't collect any of your data. There's no data collected, so there's no data to share. That's what makes Levin private.</p>\n<p>That's pretty much it. A basic overview of what we do to keep your data private &amp; confidential at Swivro. If you have any further concerns, do feel free to email us at <a href=\"mailto:support@swivro.com\">support@swivro.com</a></p>\n<p><em>(Just a side note, I do not feel that this article was very good in terms of quality &amp; professionalism. I do this for free, and it's currently midnight, so this article is better than no article regarding privacy, as we were requested by some visitors to post an article explaining how we value our visitors privacy. Thanks for understanding.)</em></p>\n<p>As always, donations are appreciated. We run on donations, to allow us to keep providing online services like Speaklink, and to help cover the \"cost\" of human labor hours. Due to some recent lack of funding via donations we were forced to implement Ad's to our website (the website you are currently on) to help fund us. If you would like to see these ad's get removed, feel free to donate at any time. It isn't required, but if you would like to consider donating, there is a button below. Thanks for reading and have a great day :)</p>\n<p> </p>\n<form action=\"https://www.paypal.com/donate\" method=\"post\" target=\"_top\"><input name=\"hosted_button_id\" type=\"hidden\" value=\"A5WM6RH64VRLS\"> <input title=\"PayPal - The safer, easier way to pay online!\" alt=\"Donate with PayPal button\" name=\"submit\" src=\"https://www.paypalobjects.com/en_US/i/btn/btn_donate_LG.gif\" type=\"image\"> <img loading=\"lazy\" src=\"https://www.paypal.com/en_US/i/scr/pixel.gif\" data-is-external-image=\"true\"  alt=\"\" width=\"1\" height=\"1\" border=\"0\" loading=\"lazy\" data-is-external-image=\"true\"></form>",
            "image": "https://news.swivro.net/media/posts/17/New-Project-2021-07-10T233359.428.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-10T23:29:39-05:00",
            "date_modified": "2021-07-10T23:34:09-05:00"
        },
        {
            "id": "https://news.swivro.net/speaklink-mobile-now-available.html",
            "url": "https://news.swivro.net/speaklink-mobile-now-available.html",
            "title": "Speaklink Mobile now available",
            "summary": "If you haven't heard of Speaklink (if you have, you can skip over this paragraph), Speaklink is a privacy-first communication&hellip;",
            "content_html": "<p>If you haven't heard of Speaklink (if you have, you can skip over this paragraph), Speaklink is a privacy-first communication platform. End-to-end encryption for messaging, calling, video calling, and screen sharing. Speaklink values your privacy and cares about security. Speaklink is <strong>easy, modern, and fast</strong>, with super lightweight code making your experience super fast, without losing any of Speaklink's great features. Use Speaklink how you want, with a light theme or a dark theme. Speaklink is accessible on any device, as long as it has internet, and a modern browser, such as Firefox, Vivaldi, Google Chrome, Microsoft Edge, etc. You can register an account aka sign up now for free WITHOUT an email address, although, an email address is highly recommended, because in the event of you forgetting or losing your password, you need an Email address to recover it. Get started at <a href=\"https://speaklink.uk.to/\" target=\"_blank\" rel=\"noopener noreferrer\">https://speaklink.uk.to</a> (will open in a new tab).</p>\n<p>Speaklink 0.2.3 features minor bug fixes, and a new dedicated mobile UI. Speaklink 0.2.3 is the stable version of the 0.2.2 prerelease.<br>The new dedicated mobile UI is powered by Matrix (like the desktop version of Speaklink), and Hydrogen web. It is extremely lightweight and functions great on mobile devices. This is the first time Speaklink officially supports Mobile, and doesn't use the desktop UI and squish it into a mobile screen.<br>Although Speaklink now has Speaklink Mobile (if you open Speaklink Web on mobile, you will be redirected to Speaklink Web Mobile, a dedicated Speaklink web app for mobile devices), you cannot register a new account on it, or open and/or join NEW chat rooms. You can also not make video or voice calls. To create a Speaklink account, and/or to join a new chat room or to open one, you need to do this on Speaklink on your browser on a desktop device, such as Windows, Mac, Ubuntu, etc. <br>Speaklink Mobile (powered by Hydrogen web) is still somewhat experimental. Experimental meaning seeing how things go and improving greatly over time. Speaklink mobile is very stable and works great in production, however, as mentioned, to register a new Speaklink account, or to join (or open) a new chat room, you need to do this on a desktop device. Speaklink Homepage now has some new features as well.<br>Speaklink Mobile can even be used on desktop but it is not recommended, as it has less features and is more plain. Speaklink Mobile link: https://speaklink.uk.to/onmobile<br><br>Speaklink official website: <a href=\"https://speaklink.uk.to\">https://speaklink.uk.to</a></p>\n<p>As always, donations are appreciated. We run on donations, to allow us to keep providing online services like Speaklink, and to help cover the \"cost\" of human labor hours. Due to some recent lack of funding via donations we were forced to implement Ad's to our website (the website you are currently on) to help fund us. If you would like to see these ad's get removed, feel free to donate at any time. It isn't required, but if you would like to consider donating, there is a button below. Thanks for reading and have a great day :)</p>\n<p> </p>\n<form action=\"https://www.paypal.com/donate\" method=\"post\" target=\"_top\"><input name=\"hosted_button_id\" type=\"hidden\" value=\"A5WM6RH64VRLS\"> <input title=\"PayPal - The safer, easier way to pay online!\" alt=\"Donate with PayPal button\" name=\"submit\" src=\"https://www.paypalobjects.com/en_US/i/btn/btn_donate_LG.gif\" type=\"image\"> <img loading=\"lazy\" src=\"https://www.paypal.com/en_US/i/scr/pixel.gif\" data-is-external-image=\"true\"  alt=\"\" width=\"1\" height=\"1\" border=\"0\"></form>",
            "image": "https://news.swivro.net/media/posts/12/New-Project-2021-07-10T130924.296.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-10T13:09:34-05:00",
            "date_modified": "2021-07-10T13:13:50-05:00"
        }
    ]
}
