{
    "version": "https://jsonfeed.org/version/1",
    "title": "Swivro",
    "description": "",
    "home_page_url": "https://swivro.net",
    "feed_url": "https://swivro.net/feed.json",
    "user_comment": "",
    "icon": "https://swivro.net/media/website/New-Project-2021-07-09T210010.184.png",
    "author": {
        "name": "Casper the Ghost"
    },
    "items": [
        {
            "id": "https://swivro.net/introducing-atlasdns-first-we-need-your-help.html",
            "url": "https://swivro.net/introducing-atlasdns-first-we-need-your-help.html",
            "title": "Introducing AtlasDNS; First we need your help!",
            "summary": "Swivro has successfully tested &amp; wants to start up a service called AtlasDNS. AtlasDNS would be a free privacy-oriented secure&hellip;",
            "content_html": "<p>Swivro has successfully tested &amp; wants to start up a service called AtlasDNS. AtlasDNS would be a free privacy-oriented secure DNS Hosting platform. You could manage your domain name's DNS Records using AtlasDNS. AtlasDNS would be a great alternative to ClouDNS, Namecheap's FreeDNS Program, Duck DNS, NO-IP, and even CloudFlare.</p>\n<p>AtlasDNS would let you create UNLIMITED DNS Records for up to 50 domain names. You can get these limits lifted &amp; receive access to be able to DNS-host up to 500 domain names in exchange for a small monthly donation (amount to be decided). AtlasDNS would eventually feature a proxy feature, similar to CloudFlare's Proxy System. You will be able to create a DNS record pointing to your origin server, still resolving all of the same data, whilst proxying your websites traffic through AtlasDNS's servers. AtlasDNS will feature advanced DDoS Protection (possibly powered by Path.net DDoS Mitigation), so by proxying your website traffic through AtlasDNS, you will be protected against not just standard protocol (Layer 4) DDoS Attacks, but also HTTP Flood (Layer 7 DDoS) Attacks. This would make AtlasDNS essentially an alternative to CloudFlare, but, the difference being, CloudFlare's main focus is their CDN network, to speed up websites aka improve their loadtime, while AtlasDNS's main focus is to defend against Cyber-Attacks (such as DDoS attacks &amp; more) and to respect your privacy. Basically, if you're using CloudFlare for proxying &amp; DDoS attack mitigation, there's no point in using it over AtlasDNS :)</p>\n<p>The only issue is, projects like AtlasDNS are not free to run. They cost money and we spend our time working on things like AtlasDNS. <strong>If you would like to perhaps see AtlasDNS become a reality, please consider donating a small amount of money to Swivro, even as low as $5. </strong>You might think we would have said \"as low as $1\" but with the new PayPal Fee's paypal would take well over 50% of that $1, so we would only receive around $0.40, whereas if you donate a small amount of $5, we would receive around $4.45. If you would like to donate, there is a button below to do so. Thank you for considering donating, and have a great day :)</p>\n<p> </p>\n<form action=\"https://www.paypal.com/donate\" method=\"post\" target=\"_top\"><input name=\"hosted_button_id\" type=\"hidden\" value=\"MBSGS9FFWADWJ\"> <input title=\"PayPal - The safer, easier way to pay online!\" alt=\"Donate with PayPal button\" name=\"submit\" src=\"https://www.paypalobjects.com/en_US/i/btn/btn_donateCC_LG.gif\" type=\"image\"> <img loading=\"lazy\" src=\"https://www.paypal.com/en_US/i/scr/pixel.gif\" data-is-external-image=\"true\"  alt=\"\" width=\"1\" height=\"1\" border=\"0\"></form>",
            "image": "https://swivro.net/media/posts/19/New-Project-2021-07-14T180608.984.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-14T18:26:42-05:00",
            "date_modified": "2021-07-14T18:26:42-05:00"
        },
        {
            "id": "https://swivro.net/introducing-pickmyhost.html",
            "url": "https://swivro.net/introducing-pickmyhost.html",
            "title": "Introducing PickMyHost",
            "summary": "Today I will be introducing PickMyHost. It's not a complicated concept. It's a website that picks what hosting service is&hellip;",
            "content_html": "<p>Today I will be introducing PickMyHost. It's not a complicated concept. It's a website that picks what hosting service is right for you, whether that's website hosting, reseller hosting, virtual server hosting, email hosting, DNS hosting, and more. PickMyHost is essentially a great alternative to HostAdvice or HostingAdvice. The difference is, PickMyHost respects your privacy, as do all Swivro Products &amp; Services, and PickMyHost only recommends top quality services, whereas on HostAdvice, you literally can easily be recommended &amp; referred to fake companies that scam their clients and are ran by 10 year old's during the summer time. PickMyHost by Swivro verifies that all companies it recommends are legit and are at the level of quality possible. PickMyHost is absolutely 100% free, and all it takes to use it is to go to the PickMyHost website. Do note, PickMyHost is not yet available to the public, but will be soon, on it's release date, more about the release date later in this post. Below you can see a screenshot of what the PickMyHost interface currently looks like and what it is expected to look like on its release date. </p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://swivro.net/media/posts/18/Screenshot_27.png\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://swivro.net/media/posts/18/responsive/Screenshot_27-xs.png 300w ,https://swivro.net/media/posts/18/responsive/Screenshot_27-sm.png 480w ,https://swivro.net/media/posts/18/responsive/Screenshot_27-md.png 768w\"  alt=\"\" width=\"421\" height=\"208\"></figure>\n<p>Options like DNS Hosting have not yet been added but are in the works. After picking an option, such as VPS Hosting, you will be brought to another page. Let's say I chose VPS (aka virtual server) hosting. It will then bring me to a page based on VPS Hosting, asking more questions. Here's a screenshot of what that would look like:</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://swivro.net/media/posts/18/Screenshot_28.png\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://swivro.net/media/posts/18/responsive/Screenshot_28-xs.png 300w ,https://swivro.net/media/posts/18/responsive/Screenshot_28-sm.png 480w ,https://swivro.net/media/posts/18/responsive/Screenshot_28-md.png 768w\"  alt=\"\" width=\"408\" height=\"264\"></figure>\n<p>After picking one of those options, it will bring you to yet another page asking what specifications you are looking for, and then from there, you will be brought to a page stating what host is right for you. We haven't finished the VPS Hosting page options (screenshot above) yet, so we can't show you what happens after clicking one of those buttons, because nothing happens (yet). If you go through the web hosting options, you will eventually come to a conclusion to what host is right for you, so here's a screenshot of what that would likely look like (design is not finalized):</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://swivro.net/media/posts/18/Screenshot_29.png\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://swivro.net/media/posts/18/responsive/Screenshot_29-xs.png 300w ,https://swivro.net/media/posts/18/responsive/Screenshot_29-sm.png 480w ,https://swivro.net/media/posts/18/responsive/Screenshot_29-md.png 768w\"  alt=\"\" width=\"400\" height=\"257\"></figure>\n<p>This project, PickMyHost, seems like a piece of cake and that it can be done in a quick hour or so, but keep in mind; I have limited time and resources, and I'm currently the only one at Swivro making these new projects. PickMyHost will have some affiliate links, after you click on 'See Pricing' for a provider that PickMyHost recommends to you based on your selections, but it will not have a lot of affiliate links. PickMyHost's job is not to make a profit via affiliate links or via ads, but it's goal is to just genuinely help people pick a hosting provider that is right for them.</p>\n<p>PickMyHost came into existence last week, and should be finalized &amp; <strong>publicly released &amp; available this week</strong>. At the time of release, we will update you via a new post here at Swivro and will provide the URL/Link to PickMyHost.  </p>\n<p>If you're wondering why no posts were made here at Swivro for 3 days, it's because, as mentioned before, I have limited time and resources and cannot post updates multiple times every day of the year.</p>\n<p>As always, donations are appreciated. We run on donations, to allow us to keep providing online services like PickMyHost, and to help cover the \"cost\" of human labor hours. Due to some recent lack of funding via donations we were forced to implement Ad's to our website (the website you are currently on) to help fund us. If you would like to see these ad's get removed, feel free to donate at any time. It isn't required, but if you would like to consider donating, there is a button below. Thanks for reading and have a great day :)</p>\n<p> </p>\n<form action=\"https://www.paypal.com/donate\" method=\"post\" target=\"_top\"><input name=\"hosted_button_id\" type=\"hidden\" value=\"A5WM6RH64VRLS\"> <input title=\"PayPal - The safer, easier way to pay online!\" alt=\"Donate with PayPal button\" name=\"submit\" src=\"https://www.paypalobjects.com/en_US/i/btn/btn_donate_LG.gif\" type=\"image\"> <img loading=\"lazy\" src=\"https://www.paypal.com/en_US/i/scr/pixel.gif\" data-is-external-image=\"true\"  alt=\"\" width=\"1\" height=\"1\" border=\"0\" loading=\"lazy\" data-is-external-image=\"true\"></form>",
            "image": "https://swivro.net/media/posts/18/New-Project-2021-07-13T223841.177.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-13T22:32:48-05:00",
            "date_modified": "2021-07-13T22:38:57-05:00"
        },
        {
            "id": "https://swivro.net/how-exactly-do-we-value-your-privacy.html",
            "url": "https://swivro.net/how-exactly-do-we-value-your-privacy.html",
            "title": "How exactly do we &#x27;value&#x27; your privacy?",
            "summary": "Here at Swivro, we are privacy-oriented. We care about privacy and security. We do our best to ensure your data&hellip;",
            "content_html": "<p>Here at Swivro, we are privacy-oriented. We care about privacy and security. We do our best to ensure your data is secure, safe, and private. We don't unethically share data with any 3rd parties and we cannot be acquired.</p>\n<p>Swivro doesn't sell your data, PERIOD.</p>\n<p>\"But wait, you just said you're privacy oriented and care sooo much about security and privacy, but you literally use CloudFlare and Google Ads! What the heck man!??!?!?\" - We are privacy oriented, and we really do care about security, Jimmy, but since our primary goal is not to make a profit (hence we considered a nonprofit), and Swivro itself does not sell commercial products as a for-profit company, we need to run a small amount of Ads on our website to continue running. It does suck, but it's one of few ways we can make money to continue running. Swivro itself does not unethically track you whatsoever, we promise. We use CloudFlare to mitigate cyber-attacks, as we do not have the funding to cover the cost of advanced in-house DDoS Protection.</p>\n<p><span style=\"text-decoration: underline;\"><strong>Moving on,</strong></span><strong> </strong>we don't collect what we don't have to, and we don't share data that isn't required to be shared. If you are a child and are under the age of 13, we will not intentionally collect your data, as per our Privacy Policy. If you are indeed under the age of 13, and have used our services, please contact us immediately and we will do our best to wipe all data in which we may have collected from you. If you are looking for the boring Privacy Policy you can see it at swivro.net/privacy-policy</p>\n<p>Yeah, that's right, I'm not even going to embed it as a clickable link (the privacy policy link above), that's how boring it is. You'll just have to put in some effort and copy and paste the link into your browser if you really want to read a boring paragraph.</p>\n<p><strong>We do our best to not store your information</strong></p>\n<p>In the case of us being contacted by a federal entity or any type of law enforcement, being forced to provide/give up information such as email addresses, IP Addresses, or general location of a visitor/user (you), Swivro will indeed give up this information. However, we do our best to NOT store any of this information whatsoever, so if we don't have this data, there is no data to share, therefore, there is no information to give up to law enforcement if/when asked.</p>\n<p>As of July 10th, 2021, the following products do collect &amp; store your data/information:</p>\n<p><strong>- File Storage/Swivro Drive</strong></p>\n<p><strong>- GitPear</strong></p>\n<p>Both of them require an email address to sign up for an account aka register for an account, hence, we have to store those email addresses in our database. Your IP Address is logged as well, but we do our best to delete it from our database as fast as possible, as frequent as possible, so that there is no data to share when asked to share data (in this case, IP addresses is the 'data' we are talking about).</p>\n<p>As of July 10th, 2021, Swivro does <strong>NOT</strong> collect your data/information from the following products:</p>\n<p><strong>- Speaklink</strong></p>\n<p><strong>- Levin</strong></p>\n<p>Although Speaklink does ask for an email address upon registration, Swivro does not host any of the chat/communication servers. The default \"homeserver\" (the physical server your data is stored on in Speaklink) is set to matrix.org. Matrix.org is the #1 Public Matrix Server (Speaklink uses the Matrix Protocol), so all data would be stored on Matrix.org's database (IF matrix.org was your selected homeserver), so Swivro would not have any access. We do host the frontend of Speaklink, but not the backend, and the frontend does not collect your data/information.</p>\n<p>Levin (Password Manager) has no data collection involved whatsoever. It's a static web app, meaning all code is ran locally on your machine. It doesn't reach out to any 3rd party websites, applications, or analytical servers, hence, Levin doesn't collect any of your data. There's no data collected, so there's no data to share. That's what makes Levin private.</p>\n<p>That's pretty much it. A basic overview of what we do to keep your data private &amp; confidential at Swivro. If you have any further concerns, do feel free to email us at <a href=\"mailto:support@swivro.com\">support@swivro.com</a></p>\n<p><em>(Just a side note, I do not feel that this article was very good in terms of quality &amp; professionalism. I do this for free, and it's currently midnight, so this article is better than no article regarding privacy, as we were requested by some visitors to post an article explaining how we value our visitors privacy. Thanks for understanding.)</em></p>\n<p>As always, donations are appreciated. We run on donations, to allow us to keep providing online services like Speaklink, and to help cover the \"cost\" of human labor hours. Due to some recent lack of funding via donations we were forced to implement Ad's to our website (the website you are currently on) to help fund us. If you would like to see these ad's get removed, feel free to donate at any time. It isn't required, but if you would like to consider donating, there is a button below. Thanks for reading and have a great day :)</p>\n<p> </p>\n<form action=\"https://www.paypal.com/donate\" method=\"post\" target=\"_top\"><input name=\"hosted_button_id\" type=\"hidden\" value=\"A5WM6RH64VRLS\"> <input title=\"PayPal - The safer, easier way to pay online!\" alt=\"Donate with PayPal button\" name=\"submit\" src=\"https://www.paypalobjects.com/en_US/i/btn/btn_donate_LG.gif\" type=\"image\"> <img loading=\"lazy\" src=\"https://www.paypal.com/en_US/i/scr/pixel.gif\" data-is-external-image=\"true\"  alt=\"\" width=\"1\" height=\"1\" border=\"0\" loading=\"lazy\" data-is-external-image=\"true\"></form>",
            "image": "https://swivro.net/media/posts/17/New-Project-2021-07-10T233359.428.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-10T23:29:39-05:00",
            "date_modified": "2021-07-10T23:34:09-05:00"
        },
        {
            "id": "https://swivro.net/speaklink-mobile-now-available.html",
            "url": "https://swivro.net/speaklink-mobile-now-available.html",
            "title": "Speaklink Mobile now available",
            "summary": "If you haven't heard of Speaklink (if you have, you can skip over this paragraph), Speaklink is a privacy-first communication&hellip;",
            "content_html": "<p>If you haven't heard of Speaklink (if you have, you can skip over this paragraph), Speaklink is a privacy-first communication platform. End-to-end encryption for messaging, calling, video calling, and screen sharing. Speaklink values your privacy and cares about security. Speaklink is <strong>easy, modern, and fast</strong>, with super lightweight code making your experience super fast, without losing any of Speaklink's great features. Use Speaklink how you want, with a light theme or a dark theme. Speaklink is accessible on any device, as long as it has internet, and a modern browser, such as Firefox, Vivaldi, Google Chrome, Microsoft Edge, etc. You can register an account aka sign up now for free WITHOUT an email address, although, an email address is highly recommended, because in the event of you forgetting or losing your password, you need an Email address to recover it. Get started at <a href=\"https://speaklink.uk.to/\" target=\"_blank\" rel=\"noopener noreferrer\">https://speaklink.uk.to</a> (will open in a new tab).</p>\n<p>Speaklink 0.2.3 features minor bug fixes, and a new dedicated mobile UI. Speaklink 0.2.3 is the stable version of the 0.2.2 prerelease.<br>The new dedicated mobile UI is powered by Matrix (like the desktop version of Speaklink), and Hydrogen web. It is extremely lightweight and functions great on mobile devices. This is the first time Speaklink officially supports Mobile, and doesn't use the desktop UI and squish it into a mobile screen.<br>Although Speaklink now has Speaklink Mobile (if you open Speaklink Web on mobile, you will be redirected to Speaklink Web Mobile, a dedicated Speaklink web app for mobile devices), you cannot register a new account on it, or open and/or join NEW chat rooms. You can also not make video or voice calls. To create a Speaklink account, and/or to join a new chat room or to open one, you need to do this on Speaklink on your browser on a desktop device, such as Windows, Mac, Ubuntu, etc. <br>Speaklink Mobile (powered by Hydrogen web) is still somewhat experimental. Experimental meaning seeing how things go and improving greatly over time. Speaklink mobile is very stable and works great in production, however, as mentioned, to register a new Speaklink account, or to join (or open) a new chat room, you need to do this on a desktop device. Speaklink Homepage now has some new features as well.<br>Speaklink Mobile can even be used on desktop but it is not recommended, as it has less features and is more plain. Speaklink Mobile link: https://speaklink.uk.to/onmobile<br><br>Speaklink official website: <a href=\"https://speaklink.uk.to\">https://speaklink.uk.to</a></p>\n<p>As always, donations are appreciated. We run on donations, to allow us to keep providing online services like Speaklink, and to help cover the \"cost\" of human labor hours. Due to some recent lack of funding via donations we were forced to implement Ad's to our website (the website you are currently on) to help fund us. If you would like to see these ad's get removed, feel free to donate at any time. It isn't required, but if you would like to consider donating, there is a button below. Thanks for reading and have a great day :)</p>\n<p> </p>\n<form action=\"https://www.paypal.com/donate\" method=\"post\" target=\"_top\"><input name=\"hosted_button_id\" type=\"hidden\" value=\"A5WM6RH64VRLS\"> <input title=\"PayPal - The safer, easier way to pay online!\" alt=\"Donate with PayPal button\" name=\"submit\" src=\"https://www.paypalobjects.com/en_US/i/btn/btn_donate_LG.gif\" type=\"image\"> <img loading=\"lazy\" src=\"https://www.paypal.com/en_US/i/scr/pixel.gif\" data-is-external-image=\"true\"  alt=\"\" width=\"1\" height=\"1\" border=\"0\"></form>",
            "image": "https://swivro.net/media/posts/12/New-Project-2021-07-10T130924.296.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-10T13:09:34-05:00",
            "date_modified": "2021-07-10T13:13:50-05:00"
        },
        {
            "id": "https://swivro.net/levin-password-manager-mobile-support-update-and-guide.html",
            "url": "https://swivro.net/levin-password-manager-mobile-support-update-and-guide.html",
            "title": "Levin for Mobile (General Update/Info)",
            "summary": "Levin has been running healthy ever since initial release. If you didn't know, Levin is a password manager, that doesn't&hellip;",
            "content_html": "<p>Levin has been running healthy ever since initial release. </p>\n<p>If you didn't know, Levin is a password manager, that doesn't store any passwords. Makes sense right? </p>\n<p>Levin lets you generate and access various passwords for various sites with only a single master password. That's right, all you have to remember is the master password. Remember one master password to access all of your passwords, anywhere, anytime, on any device. No synchronization between devices is needed. What, how? Well, it's because, when the same values are entered for the site name, username, and master password (and password length and specifications, both optional), the same exact password will always be generated. For example, if for the username, I put \"test\", for the site name, I put \"test\" and for the master password, I put \"test\", the password will always result as the following:<br><br>n5OOmzRroYD{y[PGmgEMzf5/nc_{yzdB<br><br><br><br>You can test this on your own at Levin, accessible here https://tls.levin.codes and if you put \"test\" for every input/text value, including the site name, username, and master password, it will always result the same. In this case, it is the value (made up of upper case and lower case letters and some symbols) specified above this paragraph.</p>\n<p>Moving on to the mobile support update. We said that the next Levin update would be a mobile support update, meaning it would include a mobile app for Android and iOS. Sadly, there have been some issues with securely releasing the mobile app. We now estimate the official release to be some time this month (July 2021), but we cannot guarantee anything. Fortunately, you can still get somewhat of an app (on Android Devices) for Levin. It's not a straight mobile app, but works just like one and is just as useful. Here's a quick guide on how to get started with Levin Mobile:</p>\n<p>Simply navigate to the Levin website on your Android device in Google Chrome, at levin.swivro.net. Then, click the pink button saying \"Open Levin Web\".</p>\n<p>You will then be brought to the Levin Web App. If you don't know what were talking about, it has a very obvious purple background with the Levin Logo as well. Then, you will need to click the three vertical dots on the top right of Chrome.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://swivro.net/media/posts/11/Screenshot_21.png\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://swivro.net/media/posts/11/responsive/Screenshot_21-xs.png 300w ,https://swivro.net/media/posts/11/responsive/Screenshot_21-sm.png 480w ,https://swivro.net/media/posts/11/responsive/Screenshot_21-md.png 768w\"  alt=\"\" width=\"385\" height=\"717\"></figure>\n<p>After clicking the three dots, the Chrome Menu will open. From there, you need to press \"Add to Home Screen\". This will then open a menu saying \"Add to home screen\". You will be given an option to name the app. The default name is \"Levin\", however, you can change it to what you would like to, IE: My Favorite Password Manager</p>\n<p>After this menu pops up and you have chosen the name for the app (default name is Levin; we suggest keeping it as Levin), you then have to simply press \"Add\".</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://swivro.net/media/posts/11/Screenshot_23.png\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://swivro.net/media/posts/11/responsive/Screenshot_23-xs.png 300w ,https://swivro.net/media/posts/11/responsive/Screenshot_23-sm.png 480w ,https://swivro.net/media/posts/11/responsive/Screenshot_23-md.png 768w\"  alt=\"\" width=\"390\" height=\"730\"></figure>\n<p>Another menu may pop up with a confirmation saying \"Add to home screen?\". Simply click yes.</p>\n<p>You now have a Levin Icon on the home screen of your phone, and at any time you can tap that app icon and it will open Levin in your browser automatically. From there you can generate and manage your passwords on-the-go, no sync needed of course.</p>\n<p>You may have noticed that, since Levin's official release, the design and tools haven't been updated much. There's a simple reason why. We don't update what isn't in need of an update. Levin is great the way it is, and by changing it immediately after release (a few days to weeks time), it annoys our visitors, and makes no sense, considering Levin was already fully functional and was great the way it was. We also like to keep Levin very minimal, modern, and user-friendly, which is why it has as least \"design features\" as possible, while still delivering a powerful password generator/manager solution to our visitors and users.</p>\n<p>As always, donations are appreciated. We run on donations, to allow us to keep providing online services like Levin, and more, and to help cover the \"cost\" of human labor hours. Due to some recent lack of funding via donations we were forced to implement Ad's to our website (the website you are currently on) to help fund us. If you would like to see these ad's get removed, feel free to donate at any time. It isn't required, but if you would like to consider donating, there is a button below. <strong>Thanks for reading and have a great day :)</strong></p>\n<p> </p>\n<form action=\"https://www.paypal.com/donate\" method=\"post\" target=\"_top\"><input name=\"hosted_button_id\" type=\"hidden\" value=\"A5WM6RH64VRLS\"> <input title=\"PayPal - The safer, easier way to pay online!\" alt=\"Donate with PayPal button\" name=\"submit\" src=\"https://www.paypalobjects.com/en_US/i/btn/btn_donate_LG.gif\" type=\"image\"> <img loading=\"lazy\" src=\"https://www.paypal.com/en_US/i/scr/pixel.gif\" data-is-external-image=\"true\"  alt=\"\" width=\"1\" height=\"1\" border=\"0\" loading=\"lazy\" data-is-external-image=\"true\"></form>",
            "image": "https://swivro.net/media/posts/11/New-Project-2021-07-09T231623.015.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-09T22:47:49-05:00",
            "date_modified": "2021-07-10T13:11:10-05:00"
        },
        {
            "id": "https://swivro.net/speaklink-introduction-and-02-official-release.html",
            "url": "https://swivro.net/speaklink-introduction-and-02-official-release.html",
            "title": "Speaklink Introduction &amp; 0.2 Official Release",
            "summary": "Oh boy, yet another project/branch released by Swivro this month, what could it be this time? This one, is actually&hellip;",
            "content_html": "<p>Oh boy, yet another project/branch released by Swivro this month, what could it be this time?</p>\n<p>This one, is actually our favorite project. It's called Speaklink. Speaklink is a privacy-first communication platform. End-to-end encryption for messaging, calling, video calling, and screen sharing. Speaklink values your privacy and cares about security. Speaklink is <strong>easy, modern, and fast</strong>, with super lightweight code making your experience super fast, without losing any of Speaklink's great features. Use Speaklink how you want, with a light theme or a dark theme. Speaklink is accessible on any device, as long as it has internet, and a modern browser, such as Firefox, Vivaldi, Google Chrome, Microsoft Edge, etc. You can register an account aka sign up now for free WITHOUT an email address, although, an email address is highly recommended, because in the event of you forgetting or losing your password, you need an Email address to recover it. Get started at <a href=\"https://speaklink.uk.to\" target=\"_blank\" rel=\"noopener noreferrer\">https://speaklink.uk.to</a> (will open in a new tab).</p>\n<p>This specific Speaklink Version release, 0.2, has new features in comparison to the initial release, being 0.1. This new release, 0.2, features a brand new home UI sometimes referred to as a landing page or homepage. The new UI makes it easy to learn what Speaklink is, what Speaklink offers, and how Speaklink is different. Speaklink is accessible via <a href=\"https://speaklink.uk.to\">https://speaklink.uk.to</a> made possible by the FreeDNS Network. We aren't required to state that it was made possible by the FreeDNS Network, but FreeDNS sure does help us a lot, at freedns.afraid.org</p>\n<p>Like Swivro itself, Speaklink is considered a nonprofit technology group. Nonprofit as in, the primary goal is not to make a profit. We use reliable tools like GitHub, FreeDNS, and more, to keep Speaklink online 24/7 with (pretty much) zero downtime. Speaklink uses the Matrix Backend as a chat/voice/video server. You can create your own server, even hosted on your own computer inside of a VM, to host your very own Matrix Server, and then you can use Speaklink to connect to it. A matrix server is where all chat messages are stored (encrypted of course), as well as where voice/audio (for voice calls), and video (for video calls) are processed. By default, when signing up/registering to Speaklink, the public global secure Matrix server is selected. If you're a newbie, or don't want to spend money hosting your own server, or have no idea what we are talking about, then just keep the \"homeserver/matrix server\" selected on the default option being matrix.org</p>\n<p>By connecting to the global matrix.org server network, it's just as secure as if you were hosting it yourself, because everything is fully encrypted, multiple times, end-to-end. This is more secure than nearly every other communication platform on the internet. See the security comparison here (it will open in a new tab once clicked) -&gt; <a href=\"https://speaklink.uk.to/securitycomparison.html\">https://speaklink.uk.to/securitycomparison.html</a></p>\n<p>One reason we added this entire new homepage UI for Speaklink is to allow people like students, developers, and/or people learning how to code, to build on top of Speaklink; customizing it to their liking, and improving it. Speaklink is made available under the Apache 2.0 License. The source code and update/management activity can be viewed on the official GitHub Repo, seen here -&gt; <a href=\"https://github.com/kasperireland/speaklink\" target=\"_blank\" rel=\"noopener noreferrer\">https://github.com/kasperireland/speaklink</a></p>\n<p>Of course, the current latest release is 0.2 (officially 0.2.1). You can see the Speaklink code releases here -&gt; <a href=\"https://github.com/kasperireland/speaklink/releases\">https://github.com/kasperireland/speaklink/releases</a></p>\n<p>In the latest release, 0.2 (officially 0.2.1), there is currently a bug or two, along with a visual issue. These issues were fixed, and have been applied to the \"master\" branch of the repository, along with the official Speaklink instance at Speaklink.uk.to, but have not yet been applied to a release. The next Speaklink release, 0.3, will feature the fixes. SpeakLink 0.3 will have even more new features, including a mobile app, desktop app, a (possibly) slightly cleaner UI, and more.</p>\n<p>We will continue to develop Speaklink, building upon Matrix/Element, making Speaklink even better. We believe we've already simplified the sign up process.</p>\n<p>As always, donations are appreciated. We run on donations, to allow us to keep providing online services like Speaklink, and to help cover the \"cost\" of human labor hours. Due to some recent lack of funding via donations we were forced to implement Ad's to our website (the website you are currently on) to help fund us. If you would like to see these ad's get removed, feel free to donate at any time. It isn't required, but if you would like to consider donating, there is a button below. Thanks for reading and have a great day :)</p>\n<p> </p>\n<form action=\"https://www.paypal.com/donate\" method=\"post\" target=\"_top\"><input name=\"hosted_button_id\" type=\"hidden\" value=\"A5WM6RH64VRLS\"> <input title=\"PayPal - The safer, easier way to pay online!\" alt=\"Donate with PayPal button\" name=\"submit\" src=\"https://www.paypalobjects.com/en_US/i/btn/btn_donate_LG.gif\" type=\"image\"> <img loading=\"lazy\" src=\"https://www.paypal.com/en_US/i/scr/pixel.gif\" data-is-external-image=\"true\"  alt=\"\" width=\"1\" height=\"1\" border=\"0\"></form>",
            "image": "https://swivro.net/media/posts/10/New-Project-2021-07-08T175455.382.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-08T18:16:36-05:00",
            "date_modified": "2021-07-08T18:27:24-05:00"
        },
        {
            "id": "https://swivro.net/website-tips-disabling-inspect-tool-and-developer-menu.html",
            "url": "https://swivro.net/website-tips-disabling-inspect-tool-and-developer-menu.html",
            "title": "Website Tips: Disabling Inspect Tool &amp; Developer Menu",
            "summary": "Sometimes us website owners dislike when a visitor uses the inspect element tool aka the developer tool (accessible via the&hellip;",
            "content_html": "<p>Sometimes us website owners dislike when a visitor uses the inspect element tool aka the developer tool (accessible via the F12 Key), or copies website content via copy pasting, for various reasons. Fortunately, we have <span style=\"text-decoration: underline;\"><em>somewhat</em></span><em> </em>of a solution for you.</p>\n<p>If you would like to disable the Inspect Element Tool, Right Click, and F12 Developer Menu, on your website, this will require a simple JavaScript-script. It's totally safe, it doesn't reach out to any 3rd parties or online services, it's simple, and works easily. This will also help prevent people from stealing your content by copy-pasting it, as users will not be able to select a bunch of text and copy it. All control commands are also disabled, such as control-C (copy), control-V (paste), etc. </p>\n<p>We've published the script onto 0bin for you to use. All you have to do is copy the highlighted code (everything from &lt;script&gt; to &lt;/script&gt; including &lt;script&gt; and &lt;/script&gt;) and paste it at the end of your website code. It's that easy.</p>\n<p>The downside is, users can still view the source code to your website via view-source in their browser. For example, if my website is <a href=\"https://google.com,\">https://google.com,</a> anyone can type view-source:https://google.com into their browser, and the HTML Source code will display. There's simply absolutely no way to hide this, and the best you can do it disable inspect element, developer console, and right click.</p>\n<p>Here is the link to the script on 0bin: <a href=\"https://0bin.net/paste/wNBarcSi#UEgF7VHrKHtKywuGKfusWDpslJJe630z5XNltH8mC2o\" target=\"_blank\" rel=\"noopener noreferrer\">https://0bin.net/paste/wNBarcSi#UEgF7VHrKHtKywuGKfusWDpslJJe630z5XNltH8mC2o</a></p>\n<p> </p>\n<p><strong>Why do I need this?:</strong></p>\n<p>Sometimes, actually, very often, visitors of websites steal website content by copying the content (hovering &amp; selecting with mouse then copying via right click or ctrl-v). On other occasions, visitors want to open the inspect element tool/developer menu to snoop around. This script will help prevent that. Of course, not entirely, as that is literally impossible, but it definitely helps a TON. By using this script on your website, users cant hover over content and copy it, users cant right click to then select inspect element (or any previously-available option), and users cannot toggle the developer menu with the F12 Key. Of course, they will still be able to open the developer menu/dev tools via the browser options (three dots on the top right on Chrome), but this script does a good job at hiding every other option. In other words, if you're looking for a prevention, it's for sure better to have this script then to not have it.</p>\n<p> </p>\n<p><strong>How do I know it's safe?:</strong></p>\n<p>The script is very simple and doesn't reach out to any servers or 3rd parties. You can verify this with any web developer.</p>\n<p> </p>\n<p>Thanks for reading and we hope you found this helpful!</p>\n<p> </p>\n<p> </p>\n<p> </p>",
            "image": "https://swivro.net/media/posts/8/New-Project1.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-08T00:42:00-05:00",
            "date_modified": "2021-07-09T23:20:36-05:00"
        },
        {
            "id": "https://swivro.net/levin-password-manager-11-official-release.html",
            "url": "https://swivro.net/levin-password-manager-11-official-release.html",
            "title": "Levin Password Manager 1.1 Official Release",
            "summary": "Levin, our amazing stateless password manager, has been operating flawlessly since release. It's not perfect, and never will be absolutely&hellip;",
            "content_html": "<p>Levin, our amazing stateless password manager, has been operating flawlessly since release. It's not perfect, and never will be absolutely spot-on perfect, but we always try to improve it as much as we can. Levin 1.1, our latest release, is indeed an improvement, making things simpler, quicker, and less-complicated, while still delivering the same great speed, security, privacy, ya know.</p>\n<p>Levin is mind-blowingly lightweight, so there isn't much code. Being said, we just officially released Levin 1.1. Levin 1.1 can be accessed via Levin Web at levin.swivro.net or TLS.Levin.codes. Levin 1.1 is not yet pushed to the open source GitPear repository for public-use, but will be shortly. You can still download Levin 1.1 NOW via Google Drive, more on that later in this article.</p>\n<p><strong>What's changed?</strong></p>\n<p>Levin 1.1 features no major changes. Levin 1.1 includes minor JS &amp; HTML Code changes in the Levin Web App, nothing too noticeable though. Levin features a brand new homepage, with a list of some features that Levin is proud of, and a quick button, which once pressed, brings you to Levin Web. When we say Levin Web, we mean our official public instance of Levin ran by Swivro, accessible via levin.swivro.net and only levin.swivro.net. We migrated from tls.levin.codes to levin.swivro.net to ensure security and after becoming aware of potential conflicts with Name.com, the domain registrar for tls.levin.codes such as them tracking DNS Queries, not caring about privacy, and more concerns regarding our ownership of the domain name levin.codes. The new Bootstrap homepage for Levin explains how we value your privacy, how Levin has great security, and how/why it is forever free. As mentioned, this homepage is part of the 1.1 update and will be available on the official Levin repository on GitPear. </p>\n<p><strong>What's next for Levin?</strong></p>\n<p>Levin <strong>1.2</strong> is the next Levin update. It will feature an improved UI for Levin Web, cleaner/simpler code, will be more lightweight, will feature JavaScript-encoded HTML webpage Files, and more. Levin 1.2 from 1.1 (current release) should be a bigger improvement, than the improvement from 1.0 to 1.1 (current release). Levin 1.2 should be simpler, easier, faster, and smarter. Even a baby could use it. Levin 1.2 will also feature a mobile (android) and desktop (windows) app for quick &amp; easy use for Levin Web.</p>\n<p>For everyone wondering, Levin is indeed available to be used offline. This means you can run Levin on your own device without internet, it's free, it's easy, and did we mention it's free? Levin is plain HTML, CSS, and JS. Oh, and Bootstrap.</p>\n<p>Download Levin 1.1 for your own personal or commercial use with the Google Drive link below. Remember, Levin is licensed under <span style=\"text-decoration: underline;\"><strong><a href=\"https://creativecommons.org/licenses/by-nd/4.0/\">CC By ND 4.0, the license can be viewed by clicking this text.</a></strong></span></p>\n<p>Download Levin 1.1 zip file: <a href=\"https://drive.google.com/file/d/1oy451-xrUjG_LslRKtSo-6UZLkneZTXc/view?usp=sharing\" target=\"_blank\" rel=\"noopener noreferrer\">https://drive.google.com/file/d/1oy451-xrUjG_LslRKtSo-6UZLkneZTXc/view?usp=sharing</a></p>\n<p>As always, donations are extremely appreciated. We run on them, and even $1 helps us. If you would like to consider donating just one time, whether its a small amount or not, the button is below if you wish :)</p>\n<p>Thanks for reading, and have a great day.</p>\n<p> </p>\n<form action=\"https://www.paypal.com/donate\" method=\"post\" target=\"_top\"><input name=\"hosted_button_id\" type=\"hidden\" value=\"A5WM6RH64VRLS\"> <input title=\"PayPal - The safer, easier way to pay online!\" alt=\"Donate with PayPal button\" name=\"submit\" src=\"https://www.paypalobjects.com/en_US/i/btn/btn_donate_LG.gif\" type=\"image\"> <img loading=\"lazy\" src=\"https://www.paypal.com/en_US/i/scr/pixel.gif\" data-is-external-image=\"true\"  alt=\"\" width=\"1\" height=\"1\" border=\"0\"></form>",
            "image": "https://swivro.net/media/posts/9/New-Project-2021-07-08T002318.264.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-08T00:20:20-05:00",
            "date_modified": "2021-07-08T00:24:44-05:00"
        },
        {
            "id": "https://swivro.net/whats-happening-and-whats-next.html",
            "url": "https://swivro.net/whats-happening-and-whats-next.html",
            "title": "What&#x27;s happening &amp; what&#x27;s next for Swivro?",
            "summary": "It's been a pretty busy week for Swivro thus far. We've been managing GitPear and, released Levin (tls.levin.codes) and are&hellip;",
            "content_html": "<p>It's been a pretty busy week for Swivro thus far. We've been managing GitPear and, released Levin (tls.levin.codes) and are monitoring Levin's performance, and are making some changes with our web hosting branch, HWG. We are also migrating to new servers across Swivro.</p>\n<p><strong>HWG </strong>will more than likely STOP offering web hosting publicly on July 20th-28th which can currently be bought in an instant online. We will no longer be accepting instant orders. You will need to contact us stating that you are interesting in using HWG's (HostWithGorilla.com) services, such as $3.00 web hosting. HWG will be migrating cPanel servers from LiquidNet LTD to DigitalOcean. If you contact us via <a href=\"mailto:support@swivro.com\">support@swivro.com </a>we can offer you $1 per month <em>unlimited</em> web hosting EARLY. If you want to order existing cheap web hosting plans from HWG in an instant, you should hurry up before its too late, just go to hostwithgorilla.com</p>\n<p><strong>GitPear </strong>has now been publicly operational for more than 7 days 👏👏. However, although GitPear is a free service, we really do need donations to keep running it. All of the money we receive via donations for GitPear (or Swivro) go straight back into GitPear or Swivro. If you would like to donate to only gitpear visit <a href=\"https://liberapay.com/GitPear/donate\">liberapay.com/GitPear/donate</a></p>\n<p>GitPear cannot run without donations, which is why donations play a crucial role in keeping GitPear alive. We are currently hosting GitPear with FranTech Solutions but are looking into migrating to Microsoft's Azure Platform to increase uptime and reliability. We are absolutely not saying FranTech Solutions (BuyVM Brand) is not reliable, but they do require a reboot every now and then on their entire nodes, which will cause, <em>at most</em>, a 5 minute downtime. 5 minutes is indeed nothing as we currently see it, but as GitPear grows, more and more users will use it and we need ZERO downtime when it comes to that. Until then, we will remain a FranTech Solutions Customer, and we might never even switch to Azure if we can confirm that <span style=\"text-decoration: line-through;\"><em><span style=\"text-decoration: line-through;\">Fran doesn't spill Mountain Dew all over the server equipment</span>  </em></span>our server's uptime remains extremely close to 100%. GitPear remains free and operational, and publicly accessible via <a href=\"https://gitpear.com\">https://gitpear.com</a></p>\n<p><strong>Levin</strong> Password Manager (accessible via <a href=\"https://tls.levin.codes\">tls.levin.codes</a>) is brand new. It's based off of open source JS-based software. We sprinkled some Swivro Code on it, changed up the design, are actively working on a new back-end (on our local side), and have improved it overall. Donations are also appreciated to keep running Levin. We need donations to renew the actual domain name and virtual server hosting. Levin is also free. Like all of our branches' products, Levin is privacy-oriented. Levin doesn't unethically track you in any sense whatsoever, period. Levin doesn't sell your personal information, period. Here is a basic description of Levin: <em>Remember one master password to access all of your passwords, anywhere, on any device. No sync needed. When the same values are entered for all the fields below (on <a href=\"https://tls.levin.codes\">https://tls.levin.codes</a>), the generated password will always result the same. This makes Levin an excellent secure password generator, and password manager.</em> Levin was easy to start up, but we will be actively working on the backend and user-friendliness as time moves forward.</p>\n<p><strong>We're also looking into partnering </strong>with various companies &amp; organizations which also care about privacy and security, and offer free online services, as we do. By partnering with these organizations &amp; companies, it will benefit both of us (Us at Swivro and you. the Visitor!). It will help Swivro grow, and we also get to show you what cool thing they (our partner) are offering! We're also looking into acquiring some \"dying\" hosting businesses in an attempt to continue their services. We won't ruin them though, this aint EIG (Endurance International Group).</p>\n<p><strong>The final question; what's next?</strong> We have plans for new upcoming branches of Swivro and new products, offerings, and/or services, but we don't like to say too much until it actually happens, because plans can change in a heartbeat. In other words, we don't want to announce \"this product\" which is being released next month, but then a week later announce \"this product\" is no longer being released. Just for this post, we will say, we are working towards a new offering, which will offer DNS Hosting. It's a great alternative to ClouDNS, and CloudFlare DNS (our offering will not include a domain proxy), and will be secure and reliable with tight security measures. If you would like to help fund this new upcoming project, feel free to donate to Swivro via PayPal. It's very much truly appreciated and we will do our best to send you a personal email (Not from a bot, from a human!), being the email in your PayPal account in which you used to donate to us, thanking you for donating to us at Swivro.</p>\n<p>We always do our best to provide public updates on whats happening at Swivro, so, thank you for reading! See you next time.</p>",
            "image": "https://swivro.net/media/posts/7/New-Project-2021-07-07T000819.217.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-07T00:06:30-05:00",
            "date_modified": "2021-07-07T22:07:37-05:00"
        },
        {
            "id": "https://swivro.net/introducing-levin-password-manager.html",
            "url": "https://swivro.net/introducing-levin-password-manager.html",
            "title": "Introducing Levin Password Manager",
            "summary": " Introducing Levin. Levin is a password manager, that doesn't store any passwords. Makes sense right? Levin looks more like&hellip;",
            "content_html": "\n  <p>\n    Introducing Levin. Levin is a password manager, that doesn't store any passwords. Makes sense right? Levin looks more like a password generator at first, and you wouldn't be wrong, it works, feels, and looks like one. \n<br>\n<br>Levin lets you generate and access various passwords for various sites with only a single master password. That's right, all you have to remember is the master password. Remember one master password to access all of your passwords, anywhere, anytime, on any device. No synchronization between devices is needed. What, how? Well, it's because, when the same values are entered for the site name, username, and master password (and password length and specifications, both optional), the same exact password will always be generated. For example, if for the username, I put \"test\", for the site name, I put \"test\" and for the master password, I put \"test\", the password will always result as the following:\n<br>\n<br>n5OOmzRroYD{y[PGmgEMzf5/nc_{yzdB\n<br>\n<br>\n<br>\n<br>You can test this on your own at Levin, accessible here https://tls.levin.codes and if you put \"test\" for every input/text value, including the site name, username, and master password, it will always result the same. In this case, it is the value specified above this paragraph, in italics.\n<br>\n<br>Now, how secure is it? A combination of the site name, username, and master password is SHA512/224 hashed. The output hash is encoded using a modified form of the Base64 encoding algorithm, mapping 3 character input segments to 4 characters of output. Can't understand that? It means it's pretty darn good security-wise. We don't hide anything from you either, Levin is based on open source software which you can see in the source code as a comment line. Additionally, we have licensed Levin under CC by ND 4.0. This means you can use Levin for both personal or commercial use, but attribution is required, and if you remix, transform, or build upon the material, you may not distribute the modified material.\n<br>\n<br>Additionally, along with the encryption methods stated above, your connection to the Levin website also features two layers of encryption, both being TLS Certificates. The outer layer of encryption is the CloudFlare TLS Certificate, which encrypts the connection between your browser, and CloudFlare. The inner layer of encryption, serverside, features (usually) a self-signed Levin TLS Certificate. On some occasions, a Let's Encrypt/R3, or ZeroSSL TLS Certificate will be used. Typically, we use self-signed Levin TLS Certificates. This makes a total of more than 4 encryption methods (when counting server encryption, and more) throughout Levin.\n<br>\n<br>Levin will be available forever, even if Swivro were to shut down, a rather impossible event. Levin is independently managed by its own team, Swivro itself does not actively make its own changes to Levin or any of its projects. Try Levin Now &gt; https://tls.levin.codes/\n<br>\n<br>Feel free to donate to us at any time, since we run solely on donations, and sadly, we don't have a lot of patrons. Thank you for reading.\n  </p>\n<div><form action=\"https://www.paypal.com/donate\" method=\"post\" target=\"_top\">\n<input name=\"hosted_button_id\" type=\"hidden\" value=\"A5WM6RH64VRLS\" />\n<input alt=\"Donate with PayPal button\" border=\"0\" name=\"submit\" src=\"https://www.paypalobjects.com/en_US/i/btn/btn_donate_LG.gif\" title=\"PayPal - The safer, easier way to pay online!\" type=\"image\" />\n<img loading=\"lazy\" alt=\"\" border=\"0\" height=\"1\" src=\"https://www.paypal.com/en_US/i/scr/pixel.gif\" data-is-external-image=\"true\"  width=\"1\" />\n</form>\n</div>",
            "image": "https://swivro.net/media/posts/1/New-Project-2021-07-05T163512.600.png",
            "author": {
                "name": "Casper the Ghost"
            },
            "tags": [
            ],
            "date_published": "2021-07-05T18:34:20-05:00",
            "date_modified": "2021-07-05T18:37:01-05:00"
        }
    ]
}
